RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/inc/bl808_romdriver_e907.h
/**
  ******************************************************************************
  * @file    bl808_romdriver_e907.h
  * @version V1.0
  * @date
  * @brief   This file is the standard driver header file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __BL808_ROMDRIVER_E907_H__
#define __BL808_ROMDRIVER_E907_H__

#include "bl808_glb.h"
#include "bl808_pds.h"
#include "bl808_hbn.h"
#include "bl808_clock.h"
#include "bl808_uart.h"
#include "bl808_sflash.h"
#include "bl808_xip_sflash.h"
#include "bl808_ef_ctrl.h"

/** @addtogroup  bl808_Peripheral_Driver
 *  @{
 */

/** @addtogroup  ROMDRIVER
 *  @{
 */

/** @defgroup  ROMDRIVER_Public_Types
 *  @{
 */

#define ROMAPI_INDEX_SECT_SIZE     (0x800)
#define ROMAPI_INDEX_MAX           (ROMAPI_INDEX_SECT_SIZE / 4 - 1)

typedef enum {
    ROM_API_INDEX_VERSION = 0,
    ROM_API_INDEX_RSVD_0 ,
    ROM_API_INDEX_RSVD_1,
    ROM_API_INDEX_RSVD_LAST,


    ROM_API_INDEX_AON_LowPower_Enter_PDS0,
    ROM_API_INDEX_AON_LowPower_Exit_PDS0,
    ROM_API_INDEX_AON_Power_Off_BG,
    ROM_API_INDEX_AON_Power_Off_LDO15_RF,
    ROM_API_INDEX_AON_Power_Off_MBG,
    ROM_API_INDEX_AON_Power_Off_SFReg,
    ROM_API_INDEX_AON_Power_Off_XTAL,
    ROM_API_INDEX_AON_Power_On_BG,
    ROM_API_INDEX_AON_Power_On_LDO15_RF,
    ROM_API_INDEX_AON_Power_On_MBG,
    ROM_API_INDEX_AON_Power_On_SFReg,
    ROM_API_INDEX_AON_Power_On_XTAL,
    ROM_API_INDEX_AON_Set_DCDC11_Top_Vout,
    ROM_API_INDEX_AON_Set_Xtal_CapCode,
    ROM_API_INDEX_AON_Trim_DCDC11_Vout,
    ROM_API_INDEX_AON_Trim_DCDC18_Vout,
    ROM_API_INDEX_AON_Trim_USB20_RCAL,
    ROM_API_INDEX_AON_Get_Xtal_CapCode,

    ROM_API_INDEX_ASM_Delay_Us,

    ROM_API_INDEX_arch_delay_ms,
    ROM_API_INDEX_arch_delay_us,

    ROM_API_INDEX_EF_Ctrl_Crc_Result,
    ROM_API_INDEX_EF_Ctrl_Get_Customer_PIDVID,
    ROM_API_INDEX_EF_Ctrl_Read_Chip_ID,
    ROM_API_INDEX_EF_Ctrl_Read_MAC_Address,
    ROM_API_INDEX_EF_Ctrl_Read_MAC_Address_Raw,
    ROM_API_INDEX_EF_Ctrl_AutoLoad_Done,
    ROM_API_INDEX_EF_Ctrl_Busy,
    ROM_API_INDEX_EF_Ctrl_Crc_Is_Busy,
    ROM_API_INDEX_EF_Ctrl_Get_Trim_Parity,
    ROM_API_INDEX_EF_Ctrl_Is_All_Bits_Zero,
    ROM_API_INDEX_EF_Ctrl_Clear,
    ROM_API_INDEX_EF_Ctrl_Crc_Enable,
    ROM_API_INDEX_EF_Ctrl_Crc_Set_Golden,
    ROM_API_INDEX_EF_Ctrl_Load_Efuse_R0,
    ROM_API_INDEX_EF_Ctrl_Load_Efuse_R1,
    ROM_API_INDEX_EF_Ctrl_Program_Direct,
    ROM_API_INDEX_EF_Ctrl_Program_Direct_R0,
    ROM_API_INDEX_EF_Ctrl_Program_Direct_R1,
    ROM_API_INDEX_EF_Ctrl_Program_Efuse_0,
    ROM_API_INDEX_EF_Ctrl_Program_Efuse_1,
    ROM_API_INDEX_EF_Ctrl_Read_ADC_Gain_Trim,
    ROM_API_INDEX_EF_Ctrl_Read_AES_Key,
    ROM_API_INDEX_EF_Ctrl_Read_DCDC11_Trim,
    ROM_API_INDEX_EF_Ctrl_Read_DCDC18_Trim,
    ROM_API_INDEX_EF_Ctrl_Read_Dbg_Pwd,
    ROM_API_INDEX_EF_Ctrl_Read_Device_Info,
    ROM_API_INDEX_EF_Ctrl_Read_Direct,
    ROM_API_INDEX_EF_Ctrl_Read_Direct_R0,
    ROM_API_INDEX_EF_Ctrl_Read_Direct_R1,
    ROM_API_INDEX_EF_Ctrl_Read_LDO18FLASH_Trim,
    ROM_API_INDEX_EF_Ctrl_Read_LDO18IO_Vout_Trim,
    ROM_API_INDEX_EF_Ctrl_Read_RC32K_Trim,
    ROM_API_INDEX_EF_Ctrl_Read_RC32M_Trim,
    ROM_API_INDEX_EF_Ctrl_Read_Secure_Boot,
    ROM_API_INDEX_EF_Ctrl_Read_Secure_Cfg,
    ROM_API_INDEX_EF_Ctrl_Read_Sw_Usage,
    ROM_API_INDEX_EF_Ctrl_Read_TSEN_Trim,
    ROM_API_INDEX_EF_Ctrl_Read_USB20RCAL_Trim,
    ROM_API_INDEX_EF_Ctrl_Read_Xtal_Trim_RC32M,
    ROM_API_INDEX_EF_Ctrl_Readlock_AES_Key,
    ROM_API_INDEX_EF_Ctrl_Readlock_Dbg_Pwd,
    ROM_API_INDEX_EF_Ctrl_Set_sf_key_re_sel,
    ROM_API_INDEX_EF_Ctrl_Sw_AHB_Clk_0,
    ROM_API_INDEX_EF_Ctrl_Sw_AHB_Clk_1,
    ROM_API_INDEX_EF_Ctrl_Write_AES_Key,
    ROM_API_INDEX_EF_Ctrl_Write_Dbg_Pwd,
    ROM_API_INDEX_EF_Ctrl_Write_MAC_Address,
    ROM_API_INDEX_EF_Ctrl_Write_Secure_Boot,
    ROM_API_INDEX_EF_Ctrl_Write_Secure_Cfg,
    ROM_API_INDEX_EF_Ctrl_Write_Sw_Usage,
    ROM_API_INDEX_EF_Ctrl_Writelock_AES_Key,
    ROM_API_INDEX_EF_Ctrl_Writelock_Dbg_Pwd,
    ROM_API_INDEX_EF_Ctrl_Writelock_MAC_Address,
    ROM_API_INDEX_EF_Ctrl_Writelock_Sw_Usage,

    ROM_API_INDEX_GLB_AHB_DSP_Software_Reset,
    ROM_API_INDEX_GLB_AHB_MCU_Software_Reset,
    ROM_API_INDEX_GLB_BMX_TO_Init,
    ROM_API_INDEX_GLB_Clr_BMX_TO_Status,
    ROM_API_INDEX_GLB_Clr_EMI_Reset_Gate,
    ROM_API_INDEX_GLB_Config_AUDIO_PLL,
    ROM_API_INDEX_GLB_Config_CPU_PLL,
    ROM_API_INDEX_GLB_Config_MIPI_PLL,
    ROM_API_INDEX_GLB_Config_MIPI_PLL_Div,
    ROM_API_INDEX_GLB_Config_UHS_PLL,
    ROM_API_INDEX_GLB_Config_WIFI_PLL,
    ROM_API_INDEX_GLB_DSP0_Clock_Disable,
    ROM_API_INDEX_GLB_DSP0_Clock_Enable,
    ROM_API_INDEX_GLB_DSP_Clr_MCU_IntStatus,
    ROM_API_INDEX_GLB_DSP_Codec_Sub_Reset,
    ROM_API_INDEX_GLB_DSP_DSP2_Sub_Reset,
    ROM_API_INDEX_GLB_DSP_Image_Sensor_Reset,
    ROM_API_INDEX_GLB_DSP_Peripheral_Reset,
    ROM_API_INDEX_GLB_DSP_SW_System_Reset,
    ROM_API_INDEX_GLB_DSP_Set_LP_IntEn,
    ROM_API_INDEX_GLB_DSP_Set_MCU_IntMask,
    ROM_API_INDEX_GLB_Get_Auto_Calc_Xtal_Type,
    ROM_API_INDEX_GLB_Get_DSP_PBCLK_Div,
    ROM_API_INDEX_GLB_Get_DSP_System_CLK_Div,
    ROM_API_INDEX_GLB_Get_MCU_System_CLK_Div,
    ROM_API_INDEX_GLB_Halt_CPU,
    ROM_API_INDEX_GLB_IR_LED_Driver_Disable,
    ROM_API_INDEX_GLB_IR_LED_Driver_Enable,
    ROM_API_INDEX_GLB_IR_RX_GPIO_Sel,
    ROM_API_INDEX_GLB_Invert_ETH_REF_O_CLK,
    ROM_API_INDEX_GLB_Invert_ETH_RX_CLK,
    ROM_API_INDEX_GLB_Invert_ETH_TX_CLK,
    ROM_API_INDEX_GLB_MCU_Clr_DSP_IntStatus,
    ROM_API_INDEX_GLB_MCU_SW_System_Reset,
    ROM_API_INDEX_GLB_MCU_Set_DSP_IntMask,
    ROM_API_INDEX_GLB_Output_EMAC_CLK,
    ROM_API_INDEX_GLB_PER_Clock_Gate,
    ROM_API_INDEX_GLB_PER_Clock_UnGate,
    ROM_API_INDEX_GLB_PLL_CGEN_Clock_Gate,
    ROM_API_INDEX_GLB_PLL_CGEN_Clock_UnGate,
    ROM_API_INDEX_GLB_Platform_Wakeup_PDS_Enable,
    ROM_API_INDEX_GLB_Power_Off_MU_PLL,
    ROM_API_INDEX_GLB_Power_Off_WAC_PLL,
    ROM_API_INDEX_GLB_Power_On_MU_PLL,
    ROM_API_INDEX_GLB_Power_On_WAC_PLL,
    ROM_API_INDEX_GLB_Power_On_XTAL_And_PLL_CLK,
    ROM_API_INDEX_GLB_Release_CPU,
    ROM_API_INDEX_GLB_SW_CPU_Reset,
    ROM_API_INDEX_GLB_SW_POR_Reset,
    ROM_API_INDEX_GLB_SW_System_Reset,
    ROM_API_INDEX_GLB_Sel_DSP_TMR_GPIO_Clock,
    ROM_API_INDEX_GLB_Sel_MCU_TMR_GPIO_Clock,
    ROM_API_INDEX_GLB_Set_ADC_CLK,
    ROM_API_INDEX_GLB_Set_Audio_ADC_CLK,
    ROM_API_INDEX_GLB_Set_Audio_AUTO_CLK,
    ROM_API_INDEX_GLB_Set_Audio_DAC_CLK,
    ROM_API_INDEX_GLB_Set_Audio_PDM_CLK,
    ROM_API_INDEX_GLB_Set_Auto_Calc_Xtal_Type,
    ROM_API_INDEX_GLB_Set_CAM_CLK,
    ROM_API_INDEX_GLB_Set_CPU_Reset_Address,
    ROM_API_INDEX_GLB_Set_CSI_DSI_CLK_Sel,
    ROM_API_INDEX_GLB_Set_Chip_Clock_Out0_Sel,
    ROM_API_INDEX_GLB_Set_Chip_Clock_Out1_Sel,
    ROM_API_INDEX_GLB_Set_Chip_Clock_Out2_Sel,
    ROM_API_INDEX_GLB_Set_Chip_Clock_Out3_Sel,
    ROM_API_INDEX_GLB_Set_DIG_32K_CLK,
    ROM_API_INDEX_GLB_Set_DIG_512K_CLK,
    ROM_API_INDEX_GLB_Set_DIG_CLK_Sel,
    ROM_API_INDEX_GLB_Set_DMA_CLK,
    ROM_API_INDEX_GLB_Set_DSP_CNN_CLK,
    ROM_API_INDEX_GLB_Set_DSP_DP_CLK,
    ROM_API_INDEX_GLB_Set_DSP_H264_CLK,
    ROM_API_INDEX_GLB_Set_DSP_I2C0_CLK,
    ROM_API_INDEX_GLB_Set_DSP_I2C1_CLK,
    ROM_API_INDEX_GLB_Set_DSP_DSP2_CLK,
    ROM_API_INDEX_GLB_Set_DSP_L2SRAM_Available_Size,
    ROM_API_INDEX_GLB_Set_DSP_MTimer_CLK,
    ROM_API_INDEX_GLB_Set_DSP_MUXPLL_CLK_Sel,
    ROM_API_INDEX_GLB_Set_DSP_Muxpll_160M_Sel,
    ROM_API_INDEX_GLB_Set_DSP_Muxpll_240M_Sel,
    ROM_API_INDEX_GLB_Set_DSP_Muxpll_320M_Sel,
    ROM_API_INDEX_GLB_Set_DSP_PBCLK,
    ROM_API_INDEX_GLB_Set_DSP_PBCLK_Div,
    ROM_API_INDEX_GLB_Set_DSP_PBROOT_CLK_Sel,
    ROM_API_INDEX_GLB_Set_DSP_ROOT_CLK_Sel,
    ROM_API_INDEX_GLB_Set_DSP_SPI_0_ACT_MOD_Sel,
    ROM_API_INDEX_GLB_Set_DSP_SPI_CLK,
    ROM_API_INDEX_GLB_Set_DSP_System_CLK,
    ROM_API_INDEX_GLB_Set_DSP_System_CLK_Div,
    ROM_API_INDEX_GLB_Set_DSP_UART0_CLK,
    ROM_API_INDEX_GLB_Set_DSP_UART1_CLK,
    ROM_API_INDEX_GLB_Set_DSP_XCLK_Sel,
    ROM_API_INDEX_GLB_Set_Display_CLK,
    ROM_API_INDEX_GLB_Set_EMAC_CLK,
    ROM_API_INDEX_GLB_Set_EMI_CLK,
    ROM_API_INDEX_GLB_Set_EM_Sel,
    ROM_API_INDEX_GLB_Set_ETH_REF_O_CLK_Sel,
    ROM_API_INDEX_GLB_Set_Flash_IO_PARM,
    ROM_API_INDEX_GLB_Set_Flash_Id_Value,
    ROM_API_INDEX_GLB_Set_I2C_CLK,
    ROM_API_INDEX_GLB_Set_I2S_CLK,
    ROM_API_INDEX_GLB_Set_IR_CLK,
    ROM_API_INDEX_GLB_Set_MCU_MTimer_CLK,
    ROM_API_INDEX_GLB_Set_MCU_Muxpll_160M_Sel,
    ROM_API_INDEX_GLB_Set_MCU_Muxpll_80M_Sel,
    ROM_API_INDEX_GLB_Set_MCU_SPI_0_ACT_MOD_Sel,
    ROM_API_INDEX_GLB_Set_MCU_System_CLK,
    ROM_API_INDEX_GLB_Set_MCU_System_CLK_Div,
    ROM_API_INDEX_GLB_Set_PADC_CLK,
    ROM_API_INDEX_GLB_Set_PDM_IO_Sel,
    ROM_API_INDEX_GLB_Set_PKA_CLK_Sel,
    ROM_API_INDEX_GLB_Set_PSram_CLK,
    ROM_API_INDEX_GLB_Set_PWM1_IO_Sel,
    ROM_API_INDEX_GLB_Set_PWM2_IO_Sel,
    ROM_API_INDEX_GLB_Set_Peripheral_DMA_CN,
    ROM_API_INDEX_GLB_Set_SDH_CLK,
    ROM_API_INDEX_GLB_Set_SF_CLK,
    ROM_API_INDEX_GLB_Set_SPI_CLK,
    ROM_API_INDEX_GLB_Set_SRAM_PARM,
    ROM_API_INDEX_GLB_Set_SRAM_RET,
    ROM_API_INDEX_GLB_Set_SRAM_SLP,
    ROM_API_INDEX_GLB_Set_UART2_IO_Sel,
    ROM_API_INDEX_GLB_Set_UART_CLK,
    ROM_API_INDEX_GLB_Set_USB_CLK_From_WIFIPLL,
    ROM_API_INDEX_GLB_Swap_DSP_SPI_0_MOSI_With_MISO,
    ROM_API_INDEX_GLB_Swap_MCU_SPI_0_MOSI_With_MISO,
    ROM_API_INDEX_GLB_Trim_LDO18FLASH_Vout,
    ROM_API_INDEX_GLB_Trim_LDO18IO_Vout,
    ROM_API_INDEX_GLB_UART_Fun_Sel,
    ROM_API_INDEX_GLB_UART_Sig_Swap_Set,
    ROM_API_INDEX_GLB_DSP_Get_LP_IntStatus,
    ROM_API_INDEX_GLB_DSP_Get_MCU_IntStatus,
    ROM_API_INDEX_GLB_MCU_Get_DSP_IntStatus,
    ROM_API_INDEX_GLB_Get_Core_Type,
    ROM_API_INDEX_GLB_Get_DSP_Muxpll_160M_Sel,
    ROM_API_INDEX_GLB_Get_DSP_Muxpll_240M_Sel,
    ROM_API_INDEX_GLB_Get_DSP_Muxpll_320M_Sel,
    ROM_API_INDEX_GLB_Get_DSP_PBROOT_CLK_Sel,
    ROM_API_INDEX_GLB_Get_DSP_ROOT_CLK_Sel,
    ROM_API_INDEX_GLB_Get_DSP_XCLK_Sel,
    ROM_API_INDEX_GLB_Get_MCU_Muxpll_160M_Sel,
    ROM_API_INDEX_GLB_Get_MCU_Muxpll_80M_Sel,
    ROM_API_INDEX_GLB_Get_Flash_Id_Value,
    ROM_API_INDEX_GLB_Get_SRAM_PARM,
    ROM_API_INDEX_GLB_Get_SRAM_RET,
    ROM_API_INDEX_GLB_Get_SRAM_SLP,
    ROM_API_INDEX_GLB_Get_BMX_TO_Status,
    ROM_API_INDEX_GLB_Clr_GPIO_IntStatus,
    ROM_API_INDEX_GLB_Embedded_Flash_Pad_Enable,
    ROM_API_INDEX_GLB_GPIO_Clr,
    ROM_API_INDEX_GLB_GPIO_Fifo_Clear,
    ROM_API_INDEX_GLB_GPIO_Fifo_Init,
    ROM_API_INDEX_GLB_GPIO_Fifo_IntClear,
    ROM_API_INDEX_GLB_GPIO_Fifo_IntMask,
    ROM_API_INDEX_GLB_GPIO_Fifo_Push,
    ROM_API_INDEX_GLB_GPIO_Func_Init,
    ROM_API_INDEX_GLB_GPIO_Init,
    ROM_API_INDEX_GLB_GPIO_Input_Disable,
    ROM_API_INDEX_GLB_GPIO_Input_Enable,
    ROM_API_INDEX_GLB_GPIO_IntMask,
    ROM_API_INDEX_GLB_GPIO_Int_Init,
    ROM_API_INDEX_GLB_GPIO_Output_Disable,
    ROM_API_INDEX_GLB_GPIO_Output_Enable,
    ROM_API_INDEX_GLB_GPIO_Set,
    ROM_API_INDEX_GLB_GPIO_Set_HZ,
    ROM_API_INDEX_GLB_GPIO_Write,
    ROM_API_INDEX_GLB_GPIO_Fifo_Disable,
    ROM_API_INDEX_GLB_GPIO_Fifo_Enable,
    ROM_API_INDEX_GLB_GPIO_Fifo_GetIntStatus,
    ROM_API_INDEX_GLB_Get_GPIO_IntStatus,
    ROM_API_INDEX_GLB_GPIO_Fifo_GetCount,
    ROM_API_INDEX_GLB_GPIO_Read,
    ROM_API_INDEX_GLB_GPIO_Get_Fun,

    ROM_API_INDEX_HBN_32K_Sel,
    ROM_API_INDEX_HBN_Aon_Pad_Cfg,
    ROM_API_INDEX_HBN_Aon_Pad_Ctrl,
    ROM_API_INDEX_HBN_Aon_Pad_WakeUpCfg,
    ROM_API_INDEX_HBN_Clear_IRQ,
    ROM_API_INDEX_HBN_Clear_RTC_Counter,
    ROM_API_INDEX_HBN_Clear_RTC_INT,
    ROM_API_INDEX_HBN_Disable_AComp0_IRQ,
    ROM_API_INDEX_HBN_Disable_AComp1_IRQ,
    ROM_API_INDEX_HBN_Disable_BOD_IRQ,
    ROM_API_INDEX_HBN_Enable_AComp0_IRQ,
    ROM_API_INDEX_HBN_Enable_AComp1_IRQ,
    ROM_API_INDEX_HBN_Enable_BOD_IRQ,
    ROM_API_INDEX_HBN_Enable_RTC_Counter,
    ROM_API_INDEX_HBN_GPIO_INT_Disable,
    ROM_API_INDEX_HBN_GPIO_INT_Enable,
    ROM_API_INDEX_HBN_Get_RTC_Misc_Cfg,
    ROM_API_INDEX_HBN_Get_RTC_Timer_Val,
    ROM_API_INDEX_HBN_Get_Xtal_Type,
    ROM_API_INDEX_HBN_Hw_Pu_Pd_Cfg,
    ROM_API_INDEX_HBN_PD_RC32K_All_State,
    ROM_API_INDEX_HBN_PD_RC32K_In_Poff,
    ROM_API_INDEX_HBN_PIR_Disable,
    ROM_API_INDEX_HBN_PIR_Enable,
    ROM_API_INDEX_HBN_PIR_HPF_Sel,
    ROM_API_INDEX_HBN_PIR_INT_Config,
    ROM_API_INDEX_HBN_PIR_LPF_Sel,
    ROM_API_INDEX_HBN_Pin_WakeUp_Mask,
    ROM_API_INDEX_HBN_Power_Off_RC32K,
    ROM_API_INDEX_HBN_Power_Off_Xtal_32K,
    ROM_API_INDEX_HBN_Power_On_RC32K,
    ROM_API_INDEX_HBN_Power_On_Xtal_32K,
    ROM_API_INDEX_HBN_Reset,
    ROM_API_INDEX_HBN_Set_BOD_Cfg,
    ROM_API_INDEX_HBN_Set_BOD_Config,
    ROM_API_INDEX_HBN_Set_Core_Reboot_Config,
    ROM_API_INDEX_HBN_Set_HRAM_Ret,
    ROM_API_INDEX_HBN_Set_HRAM_slp,
    ROM_API_INDEX_HBN_Set_Hand_Off_Config,
    ROM_API_INDEX_HBN_Set_IO4041_As_Xtal_32K_IO,
    ROM_API_INDEX_HBN_Set_Ldo11_All_Vout,
    ROM_API_INDEX_HBN_Set_Ldo11_Aon_Vout,
    ROM_API_INDEX_HBN_Set_Ldo11_Rt_Vout,
    ROM_API_INDEX_HBN_Set_Ldo11_Rtc_Vout,
    ROM_API_INDEX_HBN_Set_Ldo18flash_Repower_Delay,
    ROM_API_INDEX_HBN_Set_MCU_Root_CLK_Sel,
    ROM_API_INDEX_HBN_Set_MCU_XCLK_Sel,
    ROM_API_INDEX_HBN_Set_MM_Power_Config,
    ROM_API_INDEX_HBN_Set_PIR_Interval,
    ROM_API_INDEX_HBN_Set_PIR_Threshold,
    ROM_API_INDEX_HBN_Set_RTC_Misc_Cfg,
    ROM_API_INDEX_HBN_Set_RTC_Timer,
    ROM_API_INDEX_HBN_Set_Status_Flag,
    ROM_API_INDEX_HBN_Set_UART_CLK_Sel,
    ROM_API_INDEX_HBN_Set_Wakeup_Addr,
    ROM_API_INDEX_HBN_Set_Xtal_Type,
    ROM_API_INDEX_HBN_Trim_RC32K,
    ROM_API_INDEX_HBN_Get_BOD_OUT_State,
    ROM_API_INDEX_HBN_Get_INT_State,
    ROM_API_INDEX_HBN_Get_MCU_Root_CLK_Sel,
    ROM_API_INDEX_HBN_Get_MCU_XCLK_Sel,
    ROM_API_INDEX_HBN_Get_Ldo18flash_Repower_Config,
    ROM_API_INDEX_HBN_Get_PIR_Interval,
    ROM_API_INDEX_HBN_Get_PIR_Threshold,
    ROM_API_INDEX_HBN_Get_Status_Flag,
    ROM_API_INDEX_HBN_Get_Wakeup_Addr,
    ROM_API_INDEX_HBN_Get_Core_Unhalt_Config,
    ROM_API_INDEX_HBN_Get_Hand_Off_Config,
    ROM_API_INDEX_HBN_Get_MM_Power_Config,
    ROM_API_INDEX_HBN_Get_Pin_Wakeup_Mode,
    ROM_API_INDEX_HBN_Enable,
    ROM_API_INDEX_HBN_Mode_Enter,
    ROM_API_INDEX_HBN_Power_Down_Flash,

    ROM_API_INDEX_L1C_DCache_Clean_All,
    ROM_API_INDEX_L1C_DCache_Clean_By_Addr,
    ROM_API_INDEX_L1C_DCache_Clean_Invalid_All,
    ROM_API_INDEX_L1C_DCache_Clean_Invalid_By_Addr,
    ROM_API_INDEX_L1C_DCache_Disable,
    ROM_API_INDEX_L1C_DCache_Enable,
    ROM_API_INDEX_L1C_DCache_Invalid_All,
    ROM_API_INDEX_L1C_DCache_Invalid_By_Addr,
    ROM_API_INDEX_L1C_ICache_Disable,
    ROM_API_INDEX_L1C_ICache_Enable,
    ROM_API_INDEX_L1C_ICache_Invalid_All,
    ROM_API_INDEX_L1C_ICache_Invalid_By_Addr,
    ROM_API_INDEX_L1C_Set_Cache_Setting_By_ID,
    ROM_API_INDEX_L1C_Set_Wrap,
    ROM_API_INDEX_L1C_Get_None_Cache_Addr,
    ROM_API_INDEX_L1C_Is_DCache_Range,
    ROM_API_INDEX_L1C_DCache_Write_Set,

