RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/inc/bl808_romdriver_e907.h
    ROM_API_INDEX_PDS_Default_Level_Config,
    ROM_API_INDEX_PDS_Enable,
    ROM_API_INDEX_PDS_Force_Config,
    ROM_API_INDEX_PDS_IntClear,
    ROM_API_INDEX_PDS_IntMask,
    ROM_API_INDEX_PDS_Power_On_MM_System,
    ROM_API_INDEX_PDS_RAM_Config,
    ROM_API_INDEX_PDS_Reset_LP_RTC,
    ROM_API_INDEX_PDS_Set_Flash_Pad_Pull_None,
    ROM_API_INDEX_PDS_Set_Flash_Pad_Pull_None_Fast,
    ROM_API_INDEX_PDS_Set_GPIO_Pad_IntClr,
    ROM_API_INDEX_PDS_Set_GPIO_Pad_IntMask,
    ROM_API_INDEX_PDS_Set_GPIO_Pad_IntMode,
    ROM_API_INDEX_PDS_Set_GPIO_Pad_Pn_Pu_Pd_Ie,
    ROM_API_INDEX_PDS_Set_LP_Clock_Disable,
    ROM_API_INDEX_PDS_Set_LP_Clock_Enable,
    ROM_API_INDEX_PDS_Set_LP_RTC_CLK,
    ROM_API_INDEX_PDS_Set_LP_Reset_Address,
    ROM_API_INDEX_PDS_Set_LP_System_CLK,
    ROM_API_INDEX_PDS_Set_LP_System_CLK_Div,
    ROM_API_INDEX_PDS_Set_MCU0_Clock_Disable,
    ROM_API_INDEX_PDS_Set_MCU0_Clock_Enable,
    ROM_API_INDEX_PDS_Set_MCU0_Reset_Address,
    ROM_API_INDEX_PDS_Set_USB_Resume,
    ROM_API_INDEX_PDS_Set_USB_Suspend,
    ROM_API_INDEX_PDS_Trim_RC32M,
    ROM_API_INDEX_PDS_Turn_Off_USB,
    ROM_API_INDEX_PDS_Turn_On_USB,
    ROM_API_INDEX_PDS_Get_GPIO_Pad_IntStatus,
    ROM_API_INDEX_PDS_Get_IntStatus,
    ROM_API_INDEX_PDS_Get_MM_System_Power_On_State,

    ROM_API_INDEX_SF_Cfg_Deinit_Ext_Flash_Gpio,
    ROM_API_INDEX_SF_Cfg_Flash_Init,
    ROM_API_INDEX_SF_Cfg_Get_Flash_Cfg_Need_Lock,
    ROM_API_INDEX_SF_Cfg_Get_Flash_Cfg_Need_Lock_Ext,
    ROM_API_INDEX_SF_Cfg_Init_Ext_Flash_Gpio,
    ROM_API_INDEX_SF_Cfg_Init_Flash_Gpio,
    ROM_API_INDEX_SF_Cfg_Sbus2_Flash_Init,
    ROM_API_INDEX_SF_Cfg_Flash_Identify,
    ROM_API_INDEX_SF_Cfg_Flash_Identify_Ext,
    ROM_API_INDEX_SF_Ctrl_GetBusyState,
    ROM_API_INDEX_SF_Ctrl_Is_AES_Enable,
    ROM_API_INDEX_SF_Ctrl_Is_Sbus2_Enable,
    ROM_API_INDEX_SF_Ctrl_Get_Flash_Image_Offset,
    ROM_API_INDEX_SF_Ctrl_Get_Clock_Delay,
    ROM_API_INDEX_SF_Ctrl_Get_Wrap_Queue_Value,
    ROM_API_INDEX_SF_Ctrl_32bits_Addr_En,
    ROM_API_INDEX_SF_Ctrl_AES_Disable,
    ROM_API_INDEX_SF_Ctrl_AES_Enable,
    ROM_API_INDEX_SF_Ctrl_AES_Enable_BE,
    ROM_API_INDEX_SF_Ctrl_AES_Enable_LE,
    ROM_API_INDEX_SF_Ctrl_AES_Set_IV,
    ROM_API_INDEX_SF_Ctrl_AES_Set_IV_BE,
    ROM_API_INDEX_SF_Ctrl_AES_Set_Key,
    ROM_API_INDEX_SF_Ctrl_AES_Set_Key_BE,
    ROM_API_INDEX_SF_Ctrl_AES_Set_Mode,
    ROM_API_INDEX_SF_Ctrl_AES_Set_Region,
    ROM_API_INDEX_SF_Ctrl_AES_XTS_Set_IV,
    ROM_API_INDEX_SF_Ctrl_AES_XTS_Set_IV_BE,
    ROM_API_INDEX_SF_Ctrl_AES_XTS_Set_Key,
    ROM_API_INDEX_SF_Ctrl_AES_XTS_Set_Key_BE,
    ROM_API_INDEX_SF_Ctrl_Bank2_Enable,
    ROM_API_INDEX_SF_Ctrl_Cmds_Set,
    ROM_API_INDEX_SF_Ctrl_Disable,
    ROM_API_INDEX_SF_Ctrl_Disable_Wrap_Access,
    ROM_API_INDEX_SF_Ctrl_Enable,
    ROM_API_INDEX_SF_Ctrl_Flash2_Read_Icache_Set,
    ROM_API_INDEX_SF_Ctrl_Flash_Read_Icache_Set,
    ROM_API_INDEX_SF_Ctrl_Lock_Flash_Image_Offset,
    ROM_API_INDEX_SF_Ctrl_Remap_Set,
    ROM_API_INDEX_SF_Ctrl_Sbus2_Hold_Sram,
    ROM_API_INDEX_SF_Ctrl_Sbus2_Release_Sram,
    ROM_API_INDEX_SF_Ctrl_Sbus2_Replace,
    ROM_API_INDEX_SF_Ctrl_Sbus2_Revoke_replace,
    ROM_API_INDEX_SF_Ctrl_Sbus2_Set_Delay,
    ROM_API_INDEX_SF_Ctrl_Sbus_Select_Bank,
    ROM_API_INDEX_SF_Ctrl_Select_Pad,
    ROM_API_INDEX_SF_Ctrl_SendCmd,
    ROM_API_INDEX_SF_Ctrl_Set_Clock_Delay,
    ROM_API_INDEX_SF_Ctrl_Set_Flash_Image_Offset,
    ROM_API_INDEX_SF_Ctrl_Set_IO_Delay,
    ROM_API_INDEX_SF_Ctrl_Set_Owner,

    ROM_API_INDEX_SFlash_Blk32_Erase,
    ROM_API_INDEX_SFlash_Blk64_Erase,
    ROM_API_INDEX_SFlash_Chip_Erase,
    ROM_API_INDEX_SFlash_Erase,
    ROM_API_INDEX_SFlash_Erase_Security_Register,
    ROM_API_INDEX_SFlash_IDbus_Read_Enable,
    ROM_API_INDEX_SFlash_Program,
    ROM_API_INDEX_SFlash_Program_Security_Register,
    ROM_API_INDEX_SFlash_Qspi_Disable,
    ROM_API_INDEX_SFlash_Qspi_Enable,
    ROM_API_INDEX_SFlash_RCV_Enable,
    ROM_API_INDEX_SFlash_Read,
    ROM_API_INDEX_SFlash_Read_Reg,
    ROM_API_INDEX_SFlash_Read_Reg_With_Cmd,
    ROM_API_INDEX_SFlash_Read_Security_Register,
    ROM_API_INDEX_SFlash_Restore_From_Powerdown,
    ROM_API_INDEX_SFlash_Sector_Erase,
    ROM_API_INDEX_SFlash_Set32BitsAddrMode,
    ROM_API_INDEX_SFlash_SetSPIMode,
    ROM_API_INDEX_SFlash_Set_IDbus_Cfg,
    ROM_API_INDEX_SFlash_Software_Reset,
    ROM_API_INDEX_SFlash_Write_Enable,
    ROM_API_INDEX_SFlash_Write_Reg,
    ROM_API_INDEX_SFlash_Write_Reg_With_Cmd,
    ROM_API_INDEX_SFlash_Busy,
    ROM_API_INDEX_SFlash_DisableBurstWrap,
    ROM_API_INDEX_SFlash_GetDeviceId,
    ROM_API_INDEX_SFlash_GetJedecId,
    ROM_API_INDEX_SFlash_GetUniqueId,
    ROM_API_INDEX_SFlash_IDbus_Read_Disable,
    ROM_API_INDEX_SFlash_Init,
    ROM_API_INDEX_SFlash_Powerdown,
    ROM_API_INDEX_SFlash_Release_Powerdown,
    ROM_API_INDEX_SFlash_Reset_Continue_Read,
    ROM_API_INDEX_SFlash_SetBurstWrap,
    ROM_API_INDEX_SFlash_Volatile_Reg_Write_Enable,

    ROM_API_INDEX_UART_ApplyAbrResult,
    ROM_API_INDEX_UART_AutoBaudDetection,
    ROM_API_INDEX_UART_ClrRtsValue,
    ROM_API_INDEX_UART_ClrTxValue,
    ROM_API_INDEX_UART_DeInit,
    ROM_API_INDEX_UART_Disable,
    ROM_API_INDEX_UART_Enable,
    ROM_API_INDEX_UART_FifoConfig,
    ROM_API_INDEX_UART_GetBitWidth0X55,
    ROM_API_INDEX_UART_Init,
    ROM_API_INDEX_UART_IntClear,
    ROM_API_INDEX_UART_IntMask,
    ROM_API_INDEX_UART_IrConfig,
    ROM_API_INDEX_UART_RxFifoClear,
    ROM_API_INDEX_UART_SendData,
    ROM_API_INDEX_UART_SendDataBlock,
    ROM_API_INDEX_UART_SetAllowableError0X55,
    ROM_API_INDEX_UART_SetBaudRate,
    ROM_API_INDEX_UART_SetDeglitchCount,
    ROM_API_INDEX_UART_SetRS485,
    ROM_API_INDEX_UART_SetRtsValue,
    ROM_API_INDEX_UART_SetRxByteCount,
    ROM_API_INDEX_UART_SetRxDataLength,
    ROM_API_INDEX_UART_SetRxTimeoutValue,
    ROM_API_INDEX_UART_SetTxDataLength,
    ROM_API_INDEX_UART_SetTxValue,
    ROM_API_INDEX_UART_TxFifoClear,
    ROM_API_INDEX_UART_TxFreeRun,
    ROM_API_INDEX_UART_GetIntStatus,
    ROM_API_INDEX_UART_GetOverflowStatus,
    ROM_API_INDEX_UART_GetRxBusBusyStatus,
    ROM_API_INDEX_UART_GetTxBusBusyStatus,
    ROM_API_INDEX_UART_GetAutoBaudCount,
    ROM_API_INDEX_UART_GetRxByteCount,
    ROM_API_INDEX_UART_ReceiveData,
    ROM_API_INDEX_UART_GetRxFifoCount,
    ROM_API_INDEX_UART_GetTxFifoCount,

    ROM_API_INDEX_XIP_SFlash_Erase_Need_Lock,
    ROM_API_INDEX_XIP_SFlash_GetDeviceId_Need_Lock,
    ROM_API_INDEX_XIP_SFlash_GetJedecId_Need_Lock,
    ROM_API_INDEX_XIP_SFlash_GetUniqueId_Need_Lock,
    ROM_API_INDEX_XIP_SFlash_Read_Need_Lock,
    ROM_API_INDEX_XIP_SFlash_Read_Via_Cache_Need_Lock,
    ROM_API_INDEX_XIP_SFlash_State_Restore,
    ROM_API_INDEX_XIP_SFlash_State_Save,
    ROM_API_INDEX_XIP_SFlash_Write_Need_Lock,
    ROM_API_INDEX_XIP_SFlash_Opt_Enter,
    ROM_API_INDEX_XIP_SFlash_Opt_Exit,

    ROM_API_INDEX_FUNC_EMPTY_START,

    ROM_API_INDEX_FUNC_EMPTY_END = ROMAPI_INDEX_MAX

