RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/inc/bl808_romdriver_e907.h
} ROM_API_INDEX_e;

/*@} end of group ROMDRIVER_Public_Types */

/** @defgroup  ROMDRIVER_Public_Constants
 *  @{
 */

/*@} end of group ROMDRIVER_Public_Constants */

/** @defgroup  ROMDRIVER_Public_Macros
 *  @{
 */


#define ROM_APITABLE            ((uint32_t *)0x90014800)


#define RomDriver_AON_LowPower_Enter_PDS0                 \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_LowPower_Enter_PDS0])

#define RomDriver_AON_LowPower_Exit_PDS0                  \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_LowPower_Exit_PDS0])

#define RomDriver_AON_Power_Off_BG                        \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_Off_BG])

#define RomDriver_AON_Power_Off_LDO15_RF                  \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_Off_LDO15_RF])

#define RomDriver_AON_Power_Off_MBG                       \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_Off_MBG])

#define RomDriver_AON_Power_Off_SFReg                     \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_Off_SFReg])

#define RomDriver_AON_Power_Off_XTAL                      \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_Off_XTAL])

#define RomDriver_AON_Power_On_BG                         \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_On_BG])

#define RomDriver_AON_Power_On_LDO15_RF                   \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_On_LDO15_RF])

#define RomDriver_AON_Power_On_MBG                        \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_On_MBG])

#define RomDriver_AON_Power_On_SFReg                      \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_On_SFReg])

#define RomDriver_AON_Power_On_XTAL                       \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Power_On_XTAL])

#define RomDriver_AON_Set_DCDC11_Top_Vout                 \
    ((BL_Err_Type (*) (AON_DCDC_LEVEL_Type dcdcLevel))ROM_APITABLE[ROM_API_INDEX_AON_Set_DCDC11_Top_Vout])

#define RomDriver_AON_Set_Xtal_CapCode                    \
    ((BL_Err_Type (*) (uint8_t capIn, uint8_t capOut))ROM_APITABLE[ROM_API_INDEX_AON_Set_Xtal_CapCode])

#define RomDriver_AON_Trim_DCDC11_Vout                    \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Trim_DCDC11_Vout])

#define RomDriver_AON_Trim_DCDC18_Vout                    \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Trim_DCDC18_Vout])

#define RomDriver_AON_Trim_USB20_RCAL                     \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Trim_USB20_RCAL])

#define RomDriver_AON_Get_Xtal_CapCode                    \
    ((uint8_t (*) (void))ROM_APITABLE[ROM_API_INDEX_AON_Get_Xtal_CapCode])

#define RomDriver_ASM_Delay_Us                            \
    ((void (*) (uint32_t core, uint32_t cnt, uint32_t loopT))ROM_APITABLE[ROM_API_INDEX_ASM_Delay_Us])

#define RomDriver_arch_delay_ms                           \
    ((void (*) (uint32_t cnt))ROM_APITABLE[ROM_API_INDEX_arch_delay_ms])

#define RomDriver_arch_delay_us                           \
    ((void (*) (uint32_t cnt))ROM_APITABLE[ROM_API_INDEX_arch_delay_us])

#define RomDriver_EF_Ctrl_Crc_Result                      \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Crc_Result])

#define RomDriver_EF_Ctrl_Get_Customer_PIDVID             \
    ((BL_Err_Type (*) (uint16_t pid[1], uint16_t vid[1]))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Get_Customer_PIDVID])

#define RomDriver_EF_Ctrl_Read_Chip_ID                    \
    ((BL_Err_Type (*) (uint8_t chipID[8]))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_Chip_ID])

#define RomDriver_EF_Ctrl_Read_MAC_Address                \
    ((BL_Err_Type (*) (uint8_t mac[6]))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_MAC_Address])

#define RomDriver_EF_Ctrl_Read_MAC_Address_Raw            \
    ((BL_Err_Type (*) (uint8_t mac[7]))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_MAC_Address_Raw])

#define RomDriver_EF_Ctrl_AutoLoad_Done                   \
    ((BL_Sts_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_AutoLoad_Done])

#define RomDriver_EF_Ctrl_Busy                            \
    ((BL_Sts_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Busy])

#define RomDriver_EF_Ctrl_Crc_Is_Busy                     \
    ((BL_Sts_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Crc_Is_Busy])

#define RomDriver_EF_Ctrl_Get_Trim_Parity                 \
    ((uint8_t (*) (uint32_t val, uint8_t len))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Get_Trim_Parity])

#define RomDriver_EF_Ctrl_Is_All_Bits_Zero                \
    ((uint8_t (*) (uint32_t val, uint8_t start, uint8_t len))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Is_All_Bits_Zero])

#define RomDriver_EF_Ctrl_Clear                           \
    ((void (*) (uint8_t region, uint32_t index, uint32_t len))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Clear])

#define RomDriver_EF_Ctrl_Crc_Enable                      \
    ((void (*) (void))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Crc_Enable])

#define RomDriver_EF_Ctrl_Crc_Set_Golden                  \
    ((void (*) (uint32_t goldenValue))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Crc_Set_Golden])

#define RomDriver_EF_Ctrl_Load_Efuse_R0                   \
    ((void (*) (void))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Load_Efuse_R0])

#define RomDriver_EF_Ctrl_Load_Efuse_R1                   \
    ((void (*) (void))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Load_Efuse_R1])

#define RomDriver_EF_Ctrl_Program_Direct                  \
    ((void (*) (uint32_t region, uint32_t index, uint32_t *data, uint32_t len))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Program_Direct])

#define RomDriver_EF_Ctrl_Program_Direct_R0               \
    ((void (*) (uint32_t index, uint32_t *data, uint32_t len))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Program_Direct_R0])

#define RomDriver_EF_Ctrl_Program_Direct_R1               \
    ((void (*) (uint32_t index, uint32_t *data, uint32_t len))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Program_Direct_R1])

#define RomDriver_EF_Ctrl_Program_Efuse_0                 \
    ((void (*) (void))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Program_Efuse_0])

#define RomDriver_EF_Ctrl_Program_Efuse_1                 \
    ((void (*) (void))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Program_Efuse_1])

#define RomDriver_EF_Ctrl_Read_ADC_Gain_Trim              \
    ((void (*) (Efuse_ADC_Gain_Coeff_Type *trim))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_ADC_Gain_Trim])

#define RomDriver_EF_Ctrl_Read_AES_Key                    \
    ((void (*) (uint8_t index, uint32_t *keyData, uint32_t len))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_AES_Key])

