RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/inc/bl808_romdriver_e907.h
#define RomDriver_EF_Ctrl_Read_DCDC11_Trim                \
    ((void (*) (Efuse_Ana_DCDC11_Trim_Type *trim))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_DCDC11_Trim])

#define RomDriver_EF_Ctrl_Read_DCDC18_Trim                \
    ((void (*) (Efuse_Ana_DCDC18_Trim_Type *trim))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_DCDC18_Trim])

#define RomDriver_EF_Ctrl_Read_Dbg_Pwd                    \
    ((void (*) (uint8_t slot, uint32_t *passWdLow, uint32_t *passWdHigh))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_Dbg_Pwd])

#define RomDriver_EF_Ctrl_Read_Device_Info                \
    ((void (*) (Efuse_Device_Info_Type *deviceInfo))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_Device_Info])

#define RomDriver_EF_Ctrl_Read_Direct                     \
    ((void (*) (uint32_t region, uint32_t index, uint32_t *data, uint32_t len))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_Direct])

#define RomDriver_EF_Ctrl_Read_Direct_R0                  \
    ((void (*) (uint32_t index, uint32_t *data, uint32_t len))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_Direct_R0])

#define RomDriver_EF_Ctrl_Read_Direct_R1                  \
    ((void (*) (uint32_t index, uint32_t *data, uint32_t len))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_Direct_R1])

#define RomDriver_EF_Ctrl_Read_LDO18FLASH_Trim            \
    ((void (*) (Efuse_Ana_LDO18FLASH_Trim_Type *trim))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_LDO18FLASH_Trim])

#define RomDriver_EF_Ctrl_Read_LDO18IO_Vout_Trim          \
    ((void (*) (Efuse_Ana_LDO18IO_VOUT_Trim_Type *trim))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_LDO18IO_Vout_Trim])

#define RomDriver_EF_Ctrl_Read_RC32K_Trim                 \
    ((void (*) (Efuse_Ana_RC32K_Trim_Type *trim))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_RC32K_Trim])

#define RomDriver_EF_Ctrl_Read_RC32M_Trim                 \
    ((void (*) (Efuse_Ana_RC32M_Trim_Type *trim))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_RC32M_Trim])

#define RomDriver_EF_Ctrl_Read_Secure_Boot                \
    ((void (*) (EF_Ctrl_SF_AES_Type aes[2]))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_Secure_Boot])

#define RomDriver_EF_Ctrl_Read_Secure_Cfg                 \
    ((void (*) (EF_Ctrl_Sec_Param_Type *cfg))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_Secure_Cfg])

#define RomDriver_EF_Ctrl_Read_Sw_Usage                   \
    ((void (*) (uint32_t index, uint32_t *usage))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_Sw_Usage])

#define RomDriver_EF_Ctrl_Read_TSEN_Trim                  \
    ((void (*) (Efuse_TSEN_Refcode_Corner_Type *trim))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_TSEN_Trim])

#define RomDriver_EF_Ctrl_Read_USB20RCAL_Trim             \
    ((void (*) (Efuse_Ana_USB20RCAL_Trim_Type *trim))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_USB20RCAL_Trim])

#define RomDriver_EF_Ctrl_Read_Xtal_Trim_RC32M            \
    ((void (*) (uint8_t *forceNoTrim, uint8_t *noXtal))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Read_Xtal_Trim_RC32M])

#define RomDriver_EF_Ctrl_Readlock_AES_Key                \
    ((void (*) (uint8_t index, uint8_t program))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Readlock_AES_Key])

#define RomDriver_EF_Ctrl_Readlock_Dbg_Pwd                \
    ((void (*) (uint8_t program))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Readlock_Dbg_Pwd])

#define RomDriver_EF_Ctrl_Set_sf_key_re_sel               \
    ((void (*) (uint8_t ef_sf_key_re_sel))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Set_sf_key_re_sel])

#define RomDriver_EF_Ctrl_Sw_AHB_Clk_0                    \
    ((void (*) (void))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Sw_AHB_Clk_0])

#define RomDriver_EF_Ctrl_Sw_AHB_Clk_1                    \
    ((void (*) (void))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Sw_AHB_Clk_1])

#define RomDriver_EF_Ctrl_Write_AES_Key                   \
    ((void (*) (uint8_t index, uint32_t *keyData, uint32_t len, uint8_t program))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Write_AES_Key])

#define RomDriver_EF_Ctrl_Write_Dbg_Pwd                   \
    ((void (*) (uint8_t slot, uint32_t passWdLow, uint32_t passWdHigh, uint8_t program))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Write_Dbg_Pwd])

#define RomDriver_EF_Ctrl_Write_MAC_Address               \
    ((void (*) (uint8_t mac[6], uint8_t program))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Write_MAC_Address])

#define RomDriver_EF_Ctrl_Write_Secure_Boot               \
    ((void (*) (EF_Ctrl_Sign_Type sign[1], EF_Ctrl_SF_AES_Type aes[1], uint8_t program))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Write_Secure_Boot])

#define RomDriver_EF_Ctrl_Write_Secure_Cfg                \
    ((void (*) (EF_Ctrl_Sec_Param_Type *cfg, uint8_t program))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Write_Secure_Cfg])

#define RomDriver_EF_Ctrl_Write_Sw_Usage                  \
    ((void (*) (uint32_t index, uint32_t usage, uint8_t program))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Write_Sw_Usage])

#define RomDriver_EF_Ctrl_Writelock_AES_Key               \
    ((void (*) (uint8_t index, uint8_t program))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Writelock_AES_Key])

#define RomDriver_EF_Ctrl_Writelock_Dbg_Pwd               \
    ((void (*) (uint8_t program))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Writelock_Dbg_Pwd])

#define RomDriver_EF_Ctrl_Writelock_MAC_Address           \
    ((void (*) (uint8_t program))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Writelock_MAC_Address])

#define RomDriver_EF_Ctrl_Writelock_Sw_Usage              \
    ((void (*) (uint32_t index, uint8_t program))ROM_APITABLE[ROM_API_INDEX_EF_Ctrl_Writelock_Sw_Usage])

#define RomDriver_GLB_AHB_DSP_Software_Reset              \
    ((BL_Err_Type (*) (GLB_AHB_DSP_SW_Type swrst))ROM_APITABLE[ROM_API_INDEX_GLB_AHB_DSP_Software_Reset])

#define RomDriver_GLB_AHB_MCU_Software_Reset              \
    ((BL_Err_Type (*) (GLB_AHB_MCU_SW_Type swrst))ROM_APITABLE[ROM_API_INDEX_GLB_AHB_MCU_Software_Reset])

#define RomDriver_GLB_BMX_TO_Init                         \
    ((BL_Err_Type (*) (BMX_TO_Cfg_Type *BmxCfg))ROM_APITABLE[ROM_API_INDEX_GLB_BMX_TO_Init])

#define RomDriver_GLB_Clr_BMX_TO_Status                   \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Clr_BMX_TO_Status])

#define RomDriver_GLB_Clr_EMI_Reset_Gate                  \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Clr_EMI_Reset_Gate])

#define RomDriver_GLB_Config_AUDIO_PLL                    \
    ((BL_Err_Type (*) (GLB_XTAL_Type xtalType, const GLB_WAC_PLL_Cfg_Type * pllCfgList))ROM_APITABLE[ROM_API_INDEX_GLB_Config_AUDIO_PLL])

#define RomDriver_GLB_Config_CPU_PLL                      \
    ((BL_Err_Type (*) (GLB_XTAL_Type xtalType, const GLB_WAC_PLL_Cfg_Type * pllCfgList))ROM_APITABLE[ROM_API_INDEX_GLB_Config_CPU_PLL])

#define RomDriver_GLB_Config_MIPI_PLL                     \
    ((BL_Err_Type (*) (GLB_XTAL_Type xtalType, const GLB_MU_PLL_Cfg_Type * pllCfgList))ROM_APITABLE[ROM_API_INDEX_GLB_Config_MIPI_PLL])

#define RomDriver_GLB_Config_MIPI_PLL_Div                 \
    ((BL_Err_Type (*) (uint8_t divEn, uint8_t divRatio))ROM_APITABLE[ROM_API_INDEX_GLB_Config_MIPI_PLL_Div])

