RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/inc/bl808_romdriver_e907.h
#define RomDriver_GLB_Config_UHS_PLL                      \
    ((BL_Err_Type (*) (GLB_XTAL_Type xtalType, const GLB_MU_PLL_Cfg_Type * pllCfgList))ROM_APITABLE[ROM_API_INDEX_GLB_Config_UHS_PLL])

#define RomDriver_GLB_Config_WIFI_PLL                     \
    ((BL_Err_Type (*) (GLB_XTAL_Type xtalType, const GLB_WAC_PLL_Cfg_Type * pllCfgList))ROM_APITABLE[ROM_API_INDEX_GLB_Config_WIFI_PLL])

#define RomDriver_GLB_DSP0_Clock_Disable                  \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_DSP0_Clock_Disable])

#define RomDriver_GLB_DSP0_Clock_Enable                   \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_DSP0_Clock_Enable])

#define RomDriver_GLB_DSP_Clr_MCU_IntStatus               \
    ((BL_Err_Type (*) (GLB_MCU_ALL_INT_Type intType))ROM_APITABLE[ROM_API_INDEX_GLB_DSP_Clr_MCU_IntStatus])

#define RomDriver_GLB_DSP_Codec_Sub_Reset                 \
    ((BL_Err_Type (*) (GLB_DSP_CODEC_SUB_Type codecPart))ROM_APITABLE[ROM_API_INDEX_GLB_DSP_Codec_Sub_Reset])

#define RomDriver_GLB_DSP_DSP2_Sub_Reset                   \
    ((BL_Err_Type (*) (GLB_DSP_DSP2_SUB_Type dsp2Part))ROM_APITABLE[ROM_API_INDEX_GLB_DSP_DSP2_Sub_Reset])

#define RomDriver_GLB_DSP_Image_Sensor_Reset              \
    ((BL_Err_Type (*) (GLB_DSP_IMAGE_SENSOR_Type imageSensorPart))ROM_APITABLE[ROM_API_INDEX_GLB_DSP_Image_Sensor_Reset])

#define RomDriver_GLB_DSP_Peripheral_Reset                \
    ((BL_Err_Type (*) (GLB_DSP_PERIPHERAL_Type periPart))ROM_APITABLE[ROM_API_INDEX_GLB_DSP_Peripheral_Reset])

#define RomDriver_GLB_DSP_SW_System_Reset                 \
    ((BL_Err_Type (*) (GLB_DSP_SW_SYSTEM_Type sysPart))ROM_APITABLE[ROM_API_INDEX_GLB_DSP_SW_System_Reset])

#define RomDriver_GLB_DSP_Set_LP_IntEn                    \
    ((BL_Err_Type (*) (uint8_t enable, GLB_LP_ALL_INT_Type intType))ROM_APITABLE[ROM_API_INDEX_GLB_DSP_Set_LP_IntEn])

#define RomDriver_GLB_DSP_Set_MCU_IntMask                 \
    ((BL_Err_Type (*) (GLB_MCU_ALL_INT_Type intType, BL_Mask_Type intMask))ROM_APITABLE[ROM_API_INDEX_GLB_DSP_Set_MCU_IntMask])

#define RomDriver_GLB_Get_Auto_Calc_Xtal_Type             \
    ((BL_Err_Type (*) (GLB_XTAL_Type *calcXtalType))ROM_APITABLE[ROM_API_INDEX_GLB_Get_Auto_Calc_Xtal_Type])

#define RomDriver_GLB_Get_DSP_PBCLK_Div                   \
    ((BL_Err_Type (*) (uint8_t *dspPBclkDiv))ROM_APITABLE[ROM_API_INDEX_GLB_Get_DSP_PBCLK_Div])

#define RomDriver_GLB_Get_DSP_System_CLK_Div              \
    ((BL_Err_Type (*) (uint8_t *dspClkDiv, uint8_t *dspBclkDiv))ROM_APITABLE[ROM_API_INDEX_GLB_Get_DSP_System_CLK_Div])

#define RomDriver_GLB_Get_MCU_System_CLK_Div              \
    ((BL_Err_Type (*) (uint8_t *mcuClkDiv, uint8_t *mcuPBclkDiv, uint8_t *lpClkDiv))ROM_APITABLE[ROM_API_INDEX_GLB_Get_MCU_System_CLK_Div])

#define RomDriver_GLB_Halt_CPU                            \
    ((BL_Err_Type (*) (GLB_CORE_ID_Type coreID))ROM_APITABLE[ROM_API_INDEX_GLB_Halt_CPU])

#define RomDriver_GLB_IR_LED_Driver_Disable               \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_IR_LED_Driver_Disable])

#define RomDriver_GLB_IR_LED_Driver_Enable                \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_IR_LED_Driver_Enable])

#define RomDriver_GLB_IR_RX_GPIO_Sel                      \
    ((BL_Err_Type (*) (GLB_GPIO_Type gpio))ROM_APITABLE[ROM_API_INDEX_GLB_IR_RX_GPIO_Sel])

#define RomDriver_GLB_Invert_ETH_REF_O_CLK                \
    ((BL_Err_Type (*) (uint8_t enable))ROM_APITABLE[ROM_API_INDEX_GLB_Invert_ETH_REF_O_CLK])

#define RomDriver_GLB_Invert_ETH_RX_CLK                   \
    ((BL_Err_Type (*) (uint8_t enable))ROM_APITABLE[ROM_API_INDEX_GLB_Invert_ETH_RX_CLK])

#define RomDriver_GLB_Invert_ETH_TX_CLK                   \
    ((BL_Err_Type (*) (uint8_t enable))ROM_APITABLE[ROM_API_INDEX_GLB_Invert_ETH_TX_CLK])

#define RomDriver_GLB_MCU_Clr_DSP_IntStatus               \
    ((BL_Err_Type (*) (GLB_DSP_ALL_INT_Type intType))ROM_APITABLE[ROM_API_INDEX_GLB_MCU_Clr_DSP_IntStatus])

#define RomDriver_GLB_MCU_SW_System_Reset                 \
    ((BL_Err_Type (*) (GLB_MCU_SW_SYSTEM_Type sysPart))ROM_APITABLE[ROM_API_INDEX_GLB_MCU_SW_System_Reset])

#define RomDriver_GLB_MCU_Set_DSP_IntMask                 \
    ((BL_Err_Type (*) (GLB_DSP_ALL_INT_Type intType, BL_Mask_Type intMask))ROM_APITABLE[ROM_API_INDEX_GLB_MCU_Set_DSP_IntMask])

#define RomDriver_GLB_Output_EMAC_CLK                     \
    ((BL_Err_Type (*) (uint8_t gpio))ROM_APITABLE[ROM_API_INDEX_GLB_Output_EMAC_CLK])

#define RomDriver_GLB_PER_Clock_Gate                      \
    ((BL_Err_Type (*) (uint64_t ips))ROM_APITABLE[ROM_API_INDEX_GLB_PER_Clock_Gate])

#define RomDriver_GLB_PER_Clock_UnGate                    \
    ((BL_Err_Type (*) (uint64_t ips))ROM_APITABLE[ROM_API_INDEX_GLB_PER_Clock_UnGate])

#define RomDriver_GLB_PLL_CGEN_Clock_Gate                 \
    ((BL_Err_Type (*) (GLB_PLL_CGEN_Type clk))ROM_APITABLE[ROM_API_INDEX_GLB_PLL_CGEN_Clock_Gate])

#define RomDriver_GLB_PLL_CGEN_Clock_UnGate               \
    ((BL_Err_Type (*) (GLB_PLL_CGEN_Type clk))ROM_APITABLE[ROM_API_INDEX_GLB_PLL_CGEN_Clock_UnGate])

#define RomDriver_GLB_Platform_Wakeup_PDS_Enable          \
    ((BL_Err_Type (*) (uint8_t enable))ROM_APITABLE[ROM_API_INDEX_GLB_Platform_Wakeup_PDS_Enable])

#define RomDriver_GLB_Power_Off_MU_PLL                    \
    ((BL_Err_Type (*) (GLB_MU_PLL_Type pllType))ROM_APITABLE[ROM_API_INDEX_GLB_Power_Off_MU_PLL])

#define RomDriver_GLB_Power_Off_WAC_PLL                   \
    ((BL_Err_Type (*) (GLB_WAC_PLL_Type pllType))ROM_APITABLE[ROM_API_INDEX_GLB_Power_Off_WAC_PLL])

#define RomDriver_GLB_Power_On_MU_PLL                     \
    ((BL_Err_Type (*) (GLB_MU_PLL_Type pllType, const GLB_MU_PLL_Cfg_Type *const cfg, uint8_t waitStable))ROM_APITABLE[ROM_API_INDEX_GLB_Power_On_MU_PLL])

#define RomDriver_GLB_Power_On_WAC_PLL                    \
    ((BL_Err_Type (*) (GLB_WAC_PLL_Type pllType, const GLB_WAC_PLL_Cfg_Type *const cfg, uint8_t waitStable))ROM_APITABLE[ROM_API_INDEX_GLB_Power_On_WAC_PLL])

