RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/inc/bl808_romdriver_e907.h
#define RomDriver_GLB_Power_On_XTAL_And_PLL_CLK           \
    ((BL_Err_Type (*) (GLB_XTAL_Type xtalType, GLB_PLL_Type pllType))ROM_APITABLE[ROM_API_INDEX_GLB_Power_On_XTAL_And_PLL_CLK])

#define RomDriver_GLB_Release_CPU                         \
    ((BL_Err_Type (*) (GLB_CORE_ID_Type coreID))ROM_APITABLE[ROM_API_INDEX_GLB_Release_CPU])

#define RomDriver_GLB_SW_CPU_Reset                        \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_SW_CPU_Reset])

#define RomDriver_GLB_SW_POR_Reset                        \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_SW_POR_Reset])

#define RomDriver_GLB_SW_System_Reset                     \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_SW_System_Reset])

#define RomDriver_GLB_Sel_DSP_TMR_GPIO_Clock              \
    ((BL_Err_Type (*) (GLB_GPIO_Type gpioPin))ROM_APITABLE[ROM_API_INDEX_GLB_Sel_DSP_TMR_GPIO_Clock])

#define RomDriver_GLB_Sel_MCU_TMR_GPIO_Clock              \
    ((BL_Err_Type (*) (GLB_GPIO_Type gpioPin))ROM_APITABLE[ROM_API_INDEX_GLB_Sel_MCU_TMR_GPIO_Clock])

#define RomDriver_GLB_Set_ADC_CLK                         \
    ((BL_Err_Type (*) (uint8_t enable, GLB_ADC_CLK_Type clkSel, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_ADC_CLK])

#define RomDriver_GLB_Set_Audio_ADC_CLK                   \
    ((BL_Err_Type (*) (uint8_t enable, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_Audio_ADC_CLK])

#define RomDriver_GLB_Set_Audio_AUTO_CLK                  \
    ((BL_Err_Type (*) (uint8_t divEn))ROM_APITABLE[ROM_API_INDEX_GLB_Set_Audio_AUTO_CLK])

#define RomDriver_GLB_Set_Audio_DAC_CLK                   \
    ((BL_Err_Type (*) (uint8_t enable, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_Audio_DAC_CLK])

#define RomDriver_GLB_Set_Audio_PDM_CLK                   \
    ((BL_Err_Type (*) (uint8_t enable, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_Audio_PDM_CLK])

#define RomDriver_GLB_Set_Auto_Calc_Xtal_Type             \
    ((BL_Err_Type (*) (GLB_XTAL_Type calcXtalType))ROM_APITABLE[ROM_API_INDEX_GLB_Set_Auto_Calc_Xtal_Type])

#define RomDriver_GLB_Set_CAM_CLK                         \
    ((BL_Err_Type (*) (uint8_t enable, GLB_CAM_CLK_Type clkSel, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_CAM_CLK])

#define RomDriver_GLB_Set_CPU_Reset_Address               \
    ((BL_Err_Type (*) (GLB_CORE_ID_Type coreID, uint32_t addr))ROM_APITABLE[ROM_API_INDEX_GLB_Set_CPU_Reset_Address])

#define RomDriver_GLB_Set_CSI_DSI_CLK_Sel                 \
    ((BL_Err_Type (*) (GLB_CSI_DSI_CLK_SEL_Type csiClkSel, GLB_CSI_DSI_CLK_SEL_Type dsiClkSel))ROM_APITABLE[ROM_API_INDEX_GLB_Set_CSI_DSI_CLK_Sel])

#define RomDriver_GLB_Set_Chip_Clock_Out0_Sel             \
    ((BL_Err_Type (*) (GLB_CHIP_CLK_OUT_0_Type clkOutType))ROM_APITABLE[ROM_API_INDEX_GLB_Set_Chip_Clock_Out0_Sel])

#define RomDriver_GLB_Set_Chip_Clock_Out1_Sel             \
    ((BL_Err_Type (*) (GLB_CHIP_CLK_OUT_1_Type clkOutType))ROM_APITABLE[ROM_API_INDEX_GLB_Set_Chip_Clock_Out1_Sel])

#define RomDriver_GLB_Set_Chip_Clock_Out2_Sel             \
    ((BL_Err_Type (*) (GLB_CHIP_CLK_OUT_2_Type clkOutType))ROM_APITABLE[ROM_API_INDEX_GLB_Set_Chip_Clock_Out2_Sel])

#define RomDriver_GLB_Set_Chip_Clock_Out3_Sel             \
    ((BL_Err_Type (*) (GLB_CHIP_CLK_OUT_3_Type clkOutType))ROM_APITABLE[ROM_API_INDEX_GLB_Set_Chip_Clock_Out3_Sel])

#define RomDriver_GLB_Set_DIG_32K_CLK                     \
    ((BL_Err_Type (*) (uint8_t enable, uint8_t compensationEn, uint16_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DIG_32K_CLK])

#define RomDriver_GLB_Set_DIG_512K_CLK                    \
    ((BL_Err_Type (*) (uint8_t enable, uint8_t compensationEn, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DIG_512K_CLK])

#define RomDriver_GLB_Set_DIG_CLK_Sel                     \
    ((BL_Err_Type (*) (GLB_DIG_CLK_Type clkSel))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DIG_CLK_Sel])

#define RomDriver_GLB_Set_DMA_CLK                         \
    ((BL_Err_Type (*) (uint8_t enable, GLB_DMA_CLK_ID_Type clk))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DMA_CLK])

#define RomDriver_GLB_Set_DSP_CNN_CLK                     \
    ((BL_Err_Type (*) (uint8_t enable, GLB_DSP_CNN_CLK_Type clkSel, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DSP_CNN_CLK])

#define RomDriver_GLB_Set_DSP_DP_CLK                      \
    ((BL_Err_Type (*) (uint8_t enable, GLB_DSP_DP_CLK_Type clkSel, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DSP_DP_CLK])

#define RomDriver_GLB_Set_DSP_H264_CLK                    \
    ((BL_Err_Type (*) (uint8_t enable, GLB_DSP_H264_CLK_Type clkSel, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DSP_H264_CLK])

#define RomDriver_GLB_Set_DSP_I2C0_CLK                    \
    ((BL_Err_Type (*) (uint8_t enable, GLB_DSP_I2C_CLK_Type clkSel, uint8_t divEn, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DSP_I2C0_CLK])

#define RomDriver_GLB_Set_DSP_I2C1_CLK                    \
    ((BL_Err_Type (*) (uint8_t enable, GLB_DSP_I2C_CLK_Type clkSel, uint8_t divEn, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DSP_I2C1_CLK])

#define RomDriver_GLB_Set_DSP_DSP2_CLK                     \
    ((BL_Err_Type (*) (uint8_t enable, GLB_DSP_DSP2_CLK_Type clkSel, uint8_t div))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DSP_DSP2_CLK])

#define RomDriver_GLB_Set_DSP_L2SRAM_Available_Size       \
    ((BL_Err_Type (*) (uint8_t h2pfSramRel, uint8_t vramSramRel, uint8_t dspl2SramRel, uint8_t blaiSramRel))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DSP_L2SRAM_Available_Size])

#define RomDriver_GLB_Set_DSP_MTimer_CLK                  \
    ((BL_Err_Type (*) (uint8_t enable, uint16_t div, uint8_t rst))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DSP_MTimer_CLK])

#define RomDriver_GLB_Set_DSP_MUXPLL_CLK_Sel              \
    ((BL_Err_Type (*) (GLB_DSP_PLL_CLK_Type pllClk))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DSP_MUXPLL_CLK_Sel])

#define RomDriver_GLB_Set_DSP_Muxpll_160M_Sel             \
    ((BL_Err_Type (*) (GLB_DSP_MUXPLL_160M_CLK_SEL_Type clkSel))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DSP_Muxpll_160M_Sel])

#define RomDriver_GLB_Set_DSP_Muxpll_240M_Sel             \
    ((BL_Err_Type (*) (GLB_DSP_MUXPLL_240M_CLK_SEL_Type clkSel))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DSP_Muxpll_240M_Sel])

#define RomDriver_GLB_Set_DSP_Muxpll_320M_Sel             \
    ((BL_Err_Type (*) (GLB_DSP_MUXPLL_320M_CLK_SEL_Type clkSel))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DSP_Muxpll_320M_Sel])

#define RomDriver_GLB_Set_DSP_PBCLK                       \
    ((BL_Err_Type (*) (GLB_DSP_SYS_PBCLK_Type pbClkSel))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DSP_PBCLK])

#define RomDriver_GLB_Set_DSP_PBCLK_Div                   \
    ((BL_Err_Type (*) (uint8_t dspPBclkDiv))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DSP_PBCLK_Div])

#define RomDriver_GLB_Set_DSP_PBROOT_CLK_Sel              \
    ((BL_Err_Type (*) (GLB_DSP_PBROOT_CLK_Type pbrootClk))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DSP_PBROOT_CLK_Sel])

#define RomDriver_GLB_Set_DSP_ROOT_CLK_Sel                \
    ((BL_Err_Type (*) (GLB_DSP_ROOT_CLK_Type rootClk))ROM_APITABLE[ROM_API_INDEX_GLB_Set_DSP_ROOT_CLK_Sel])

