RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/inc/bl808_romdriver_e907.h
#define RomDriver_GLB_Set_USB_CLK_From_WIFIPLL            \
    ((BL_Err_Type (*) (uint8_t enable))ROM_APITABLE[ROM_API_INDEX_GLB_Set_USB_CLK_From_WIFIPLL])

#define RomDriver_GLB_Swap_DSP_SPI_0_MOSI_With_MISO       \
    ((BL_Err_Type (*) (BL_Fun_Type newState))ROM_APITABLE[ROM_API_INDEX_GLB_Swap_DSP_SPI_0_MOSI_With_MISO])

#define RomDriver_GLB_Swap_MCU_SPI_0_MOSI_With_MISO       \
    ((BL_Err_Type (*) (BL_Fun_Type newState))ROM_APITABLE[ROM_API_INDEX_GLB_Swap_MCU_SPI_0_MOSI_With_MISO])

#define RomDriver_GLB_Trim_LDO18FLASH_Vout                \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Trim_LDO18FLASH_Vout])

#define RomDriver_GLB_Trim_LDO18IO_Vout                   \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Trim_LDO18IO_Vout])

#define RomDriver_GLB_UART_Fun_Sel                        \
    ((BL_Err_Type (*) (GLB_UART_SIG_Type sig, GLB_UART_SIG_FUN_Type fun))ROM_APITABLE[ROM_API_INDEX_GLB_UART_Fun_Sel])

#define RomDriver_GLB_UART_Sig_Swap_Set                   \
    ((BL_Err_Type (*) (GLB_UART_SIG_SWAP_GRP_Type group, uint8_t swap))ROM_APITABLE[ROM_API_INDEX_GLB_UART_Sig_Swap_Set])

#define RomDriver_GLB_DSP_Get_LP_IntStatus                \
    ((BL_Sts_Type (*) (GLB_LP_ALL_INT_Type intType))ROM_APITABLE[ROM_API_INDEX_GLB_DSP_Get_LP_IntStatus])

#define RomDriver_GLB_DSP_Get_MCU_IntStatus               \
    ((BL_Sts_Type (*) (GLB_MCU_ALL_INT_Type intType))ROM_APITABLE[ROM_API_INDEX_GLB_DSP_Get_MCU_IntStatus])

#define RomDriver_GLB_MCU_Get_DSP_IntStatus               \
    ((BL_Sts_Type (*) (GLB_DSP_ALL_INT_Type intType))ROM_APITABLE[ROM_API_INDEX_GLB_MCU_Get_DSP_IntStatus])

#define RomDriver_GLB_Get_Core_Type                       \
    ((GLB_CORE_ID_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Get_Core_Type])

#define RomDriver_GLB_Get_DSP_Muxpll_160M_Sel             \
    ((GLB_DSP_MUXPLL_160M_CLK_SEL_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Get_DSP_Muxpll_160M_Sel])

#define RomDriver_GLB_Get_DSP_Muxpll_240M_Sel             \
    ((GLB_DSP_MUXPLL_240M_CLK_SEL_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Get_DSP_Muxpll_240M_Sel])

#define RomDriver_GLB_Get_DSP_Muxpll_320M_Sel             \
    ((GLB_DSP_MUXPLL_320M_CLK_SEL_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Get_DSP_Muxpll_320M_Sel])

#define RomDriver_GLB_Get_DSP_PBROOT_CLK_Sel              \
    ((GLB_DSP_PBROOT_CLK_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Get_DSP_PBROOT_CLK_Sel])

#define RomDriver_GLB_Get_DSP_ROOT_CLK_Sel                \
    ((GLB_DSP_ROOT_CLK_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Get_DSP_ROOT_CLK_Sel])

#define RomDriver_GLB_Get_DSP_XCLK_Sel                    \
    ((GLB_DSP_XCLK_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Get_DSP_XCLK_Sel])

#define RomDriver_GLB_Get_MCU_Muxpll_160M_Sel             \
    ((GLB_MCU_MUXPLL_160M_CLK_SEL_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Get_MCU_Muxpll_160M_Sel])

#define RomDriver_GLB_Get_MCU_Muxpll_80M_Sel              \
    ((GLB_MCU_MUXPLL_80M_CLK_SEL_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Get_MCU_Muxpll_80M_Sel])

#define RomDriver_GLB_Get_Flash_Id_Value                  \
    ((uint32_t (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Get_Flash_Id_Value])

#define RomDriver_GLB_Get_SRAM_PARM                       \
    ((uint32_t (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Get_SRAM_PARM])

#define RomDriver_GLB_Get_SRAM_RET                        \
    ((uint32_t (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Get_SRAM_RET])

#define RomDriver_GLB_Get_SRAM_SLP                        \
    ((uint32_t (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Get_SRAM_SLP])

#define RomDriver_GLB_Get_BMX_TO_Status                   \
    ((uint8_t (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Get_BMX_TO_Status])

#define RomDriver_GLB_Clr_GPIO_IntStatus                  \
    ((BL_Err_Type (*) (GLB_GPIO_Type gpioPin))ROM_APITABLE[ROM_API_INDEX_GLB_Clr_GPIO_IntStatus])

#define RomDriver_GLB_Embedded_Flash_Pad_Enable           \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_Embedded_Flash_Pad_Enable])

#define RomDriver_GLB_GPIO_Clr                            \
    ((BL_Err_Type (*) (GLB_GPIO_Type gpioPin))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_Clr])

#define RomDriver_GLB_GPIO_Fifo_Clear                     \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_Fifo_Clear])

#define RomDriver_GLB_GPIO_Fifo_Init                      \
    ((BL_Err_Type (*) (GLB_GPIO_FIFO_CFG_Type *cfg))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_Fifo_Init])

#define RomDriver_GLB_GPIO_Fifo_IntClear                  \
    ((BL_Err_Type (*) (GLB_GPIO_FIFO_INT_Type intType))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_Fifo_IntClear])

#define RomDriver_GLB_GPIO_Fifo_IntMask                   \
    ((BL_Err_Type (*) (GLB_GPIO_FIFO_INT_Type intType, BL_Mask_Type intMask))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_Fifo_IntMask])

#define RomDriver_GLB_GPIO_Fifo_Push                      \
    ((BL_Err_Type (*) (uint16_t *data, uint16_t len))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_Fifo_Push])

#define RomDriver_GLB_GPIO_Func_Init                      \
    ((BL_Err_Type (*) (GLB_GPIO_FUNC_Type gpioFun, GLB_GPIO_Type *pinList, uint8_t cnt))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_Func_Init])

#define RomDriver_GLB_GPIO_Init                           \
    ((BL_Err_Type (*) (GLB_GPIO_Cfg_Type *cfg))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_Init])

#define RomDriver_GLB_GPIO_Input_Disable                  \
    ((BL_Err_Type (*) (GLB_GPIO_Type gpioPin))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_Input_Disable])

#define RomDriver_GLB_GPIO_Input_Enable                   \
    ((BL_Err_Type (*) (GLB_GPIO_Type gpioPin))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_Input_Enable])

#define RomDriver_GLB_GPIO_IntMask                        \
    ((BL_Err_Type (*) (GLB_GPIO_Type gpioPin, BL_Mask_Type intMask))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_IntMask])

#define RomDriver_GLB_GPIO_Int_Init                       \
    ((BL_Err_Type (*) (GLB_GPIO_INT_Cfg_Type *intCfg))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_Int_Init])

#define RomDriver_GLB_GPIO_Output_Disable                 \
    ((BL_Err_Type (*) (GLB_GPIO_Type gpioPin))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_Output_Disable])

