RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/inc/bl808_romdriver_e907.h
#define RomDriver_GLB_GPIO_Output_Enable                  \
    ((BL_Err_Type (*) (GLB_GPIO_Type gpioPin))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_Output_Enable])

#define RomDriver_GLB_GPIO_Set                            \
    ((BL_Err_Type (*) (GLB_GPIO_Type gpioPin))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_Set])

#define RomDriver_GLB_GPIO_Set_HZ                         \
    ((BL_Err_Type (*) (GLB_GPIO_Type gpioPin))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_Set_HZ])

#define RomDriver_GLB_GPIO_Write                          \
    ((BL_Err_Type (*) (GLB_GPIO_Type gpioPin, uint32_t val))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_Write])

#define RomDriver_GLB_GPIO_Fifo_Disable                   \
    ((BL_Sts_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_Fifo_Disable])

#define RomDriver_GLB_GPIO_Fifo_Enable                    \
    ((BL_Sts_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_Fifo_Enable])

#define RomDriver_GLB_GPIO_Fifo_GetIntStatus              \
    ((BL_Sts_Type (*) (GLB_GPIO_FIFO_INT_Type intType))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_Fifo_GetIntStatus])

#define RomDriver_GLB_Get_GPIO_IntStatus                  \
    ((BL_Sts_Type (*) (GLB_GPIO_Type gpioPin))ROM_APITABLE[ROM_API_INDEX_GLB_Get_GPIO_IntStatus])

#define RomDriver_GLB_GPIO_Fifo_GetCount                  \
    ((uint32_t (*) (void))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_Fifo_GetCount])

#define RomDriver_GLB_GPIO_Read                           \
    ((uint32_t (*) (GLB_GPIO_Type gpioPin))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_Read])

#define RomDriver_GLB_GPIO_Get_Fun                        \
    ((uint8_t (*) (GLB_GPIO_Type gpioPin))ROM_APITABLE[ROM_API_INDEX_GLB_GPIO_Get_Fun])

#define RomDriver_HBN_32K_Sel                             \
    ((BL_Err_Type (*) (HBN_32K_CLK_Type clkType))ROM_APITABLE[ROM_API_INDEX_HBN_32K_Sel])

#define RomDriver_HBN_Aon_Pad_Cfg                         \
    ((BL_Err_Type (*) (uint8_t aonPadHwCtrlEn, HBN_AON_PAD_Type aonGpio, HBN_AON_PAD_CFG_Type *aonPadCfg))ROM_APITABLE[ROM_API_INDEX_HBN_Aon_Pad_Cfg])

#define RomDriver_HBN_Aon_Pad_Ctrl                        \
    ((BL_Err_Type (*) (uint32_t aonPadCtl1, uint32_t aonPadCtl2))ROM_APITABLE[ROM_API_INDEX_HBN_Aon_Pad_Ctrl])

#define RomDriver_HBN_Aon_Pad_WakeUpCfg                   \
    ((BL_Err_Type (*) (BL_Fun_Type puPdEn, HBN_GPIO_INT_Trigger_Type trigMode, uint32_t maskVal, BL_Fun_Type dlyEn, uint8_t dlySec))ROM_APITABLE[ROM_API_INDEX_HBN_Aon_Pad_WakeUpCfg])

#define RomDriver_HBN_Clear_IRQ                           \
    ((BL_Err_Type (*) (HBN_INT_Type irqType))ROM_APITABLE[ROM_API_INDEX_HBN_Clear_IRQ])

#define RomDriver_HBN_Clear_RTC_Counter                   \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Clear_RTC_Counter])

#define RomDriver_HBN_Clear_RTC_INT                       \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Clear_RTC_INT])

#define RomDriver_HBN_Disable_AComp0_IRQ                  \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Disable_AComp0_IRQ])

#define RomDriver_HBN_Disable_AComp1_IRQ                  \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Disable_AComp1_IRQ])

#define RomDriver_HBN_Disable_BOD_IRQ                     \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Disable_BOD_IRQ])

#define RomDriver_HBN_Enable_AComp0_IRQ                   \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Enable_AComp0_IRQ])

#define RomDriver_HBN_Enable_AComp1_IRQ                   \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Enable_AComp1_IRQ])

#define RomDriver_HBN_Enable_BOD_IRQ                      \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Enable_BOD_IRQ])

#define RomDriver_HBN_Enable_RTC_Counter                  \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Enable_RTC_Counter])

#define RomDriver_HBN_GPIO_INT_Disable                    \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_GPIO_INT_Disable])

#define RomDriver_HBN_GPIO_INT_Enable                     \
    ((BL_Err_Type (*) (HBN_GPIO_INT_Trigger_Type gpioIntTrigType))ROM_APITABLE[ROM_API_INDEX_HBN_GPIO_INT_Enable])

#define RomDriver_HBN_Get_RTC_Misc_Cfg                    \
    ((BL_Err_Type (*) (HBN_RTC_MISC_Type *cfg))ROM_APITABLE[ROM_API_INDEX_HBN_Get_RTC_Misc_Cfg])

#define RomDriver_HBN_Get_RTC_Timer_Val                   \
    ((BL_Err_Type (*) (uint32_t *valLow, uint32_t *valHigh))ROM_APITABLE[ROM_API_INDEX_HBN_Get_RTC_Timer_Val])

#define RomDriver_HBN_Get_Xtal_Type                       \
    ((BL_Err_Type (*) (uint8_t *xtalType))ROM_APITABLE[ROM_API_INDEX_HBN_Get_Xtal_Type])

#define RomDriver_HBN_Hw_Pu_Pd_Cfg                        \
    ((BL_Err_Type (*) (uint8_t enable))ROM_APITABLE[ROM_API_INDEX_HBN_Hw_Pu_Pd_Cfg])

#define RomDriver_HBN_PD_RC32K_All_State                  \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_PD_RC32K_All_State])

#define RomDriver_HBN_PD_RC32K_In_Poff                    \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_PD_RC32K_In_Poff])

#define RomDriver_HBN_PIR_Disable                         \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_PIR_Disable])

#define RomDriver_HBN_PIR_Enable                          \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_PIR_Enable])

#define RomDriver_HBN_PIR_HPF_Sel                         \
    ((BL_Err_Type (*) (HBN_PIR_HPF_Type hpf))ROM_APITABLE[ROM_API_INDEX_HBN_PIR_HPF_Sel])

#define RomDriver_HBN_PIR_INT_Config                      \
    ((BL_Err_Type (*) (HBN_PIR_INT_CFG_Type *pirIntCfg))ROM_APITABLE[ROM_API_INDEX_HBN_PIR_INT_Config])

#define RomDriver_HBN_PIR_LPF_Sel                         \
    ((BL_Err_Type (*) (HBN_PIR_LPF_Type lpf))ROM_APITABLE[ROM_API_INDEX_HBN_PIR_LPF_Sel])

#define RomDriver_HBN_Pin_WakeUp_Mask                     \
    ((BL_Err_Type (*) (uint8_t maskVal))ROM_APITABLE[ROM_API_INDEX_HBN_Pin_WakeUp_Mask])

#define RomDriver_HBN_Power_Off_RC32K                     \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Power_Off_RC32K])

#define RomDriver_HBN_Power_Off_Xtal_32K                  \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Power_Off_Xtal_32K])

#define RomDriver_HBN_Power_On_RC32K                      \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Power_On_RC32K])

#define RomDriver_HBN_Power_On_Xtal_32K                   \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Power_On_Xtal_32K])

