RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/inc/bl808_romdriver_e907.h
#define RomDriver_HBN_Reset                               \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Reset])

#define RomDriver_HBN_Set_BOD_Cfg                         \
    ((BL_Err_Type (*) (HBN_BOD_CFG_Type *cfg))ROM_APITABLE[ROM_API_INDEX_HBN_Set_BOD_Cfg])

#define RomDriver_HBN_Set_BOD_Config                      \
    ((BL_Err_Type (*) (uint8_t enable, HBN_BOD_THRES_Type threshold, HBN_BOD_MODE_Type mode))ROM_APITABLE[ROM_API_INDEX_HBN_Set_BOD_Config])

#define RomDriver_HBN_Set_Core_Reboot_Config              \
    ((BL_Err_Type (*) (uint8_t core, uint8_t hcfg))ROM_APITABLE[ROM_API_INDEX_HBN_Set_Core_Reboot_Config])

#define RomDriver_HBN_Set_HRAM_Ret                        \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Set_HRAM_Ret])

#define RomDriver_HBN_Set_HRAM_slp                        \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Set_HRAM_slp])

#define RomDriver_HBN_Set_Hand_Off_Config                 \
    ((BL_Err_Type (*) (uint8_t dcfg))ROM_APITABLE[ROM_API_INDEX_HBN_Set_Hand_Off_Config])

#define RomDriver_HBN_Set_IO4041_As_Xtal_32K_IO           \
    ((BL_Err_Type (*) (uint8_t xtal32kIoEn))ROM_APITABLE[ROM_API_INDEX_HBN_Set_IO4041_As_Xtal_32K_IO])

#define RomDriver_HBN_Set_Ldo11_All_Vout                  \
    ((BL_Err_Type (*) (HBN_LDO_LEVEL_Type ldoLevel))ROM_APITABLE[ROM_API_INDEX_HBN_Set_Ldo11_All_Vout])

#define RomDriver_HBN_Set_Ldo11_Aon_Vout                  \
    ((BL_Err_Type (*) (HBN_LDO_LEVEL_Type ldoLevel))ROM_APITABLE[ROM_API_INDEX_HBN_Set_Ldo11_Aon_Vout])

#define RomDriver_HBN_Set_Ldo11_Rt_Vout                   \
    ((BL_Err_Type (*) (HBN_LDO_LEVEL_Type ldoLevel))ROM_APITABLE[ROM_API_INDEX_HBN_Set_Ldo11_Rt_Vout])

#define RomDriver_HBN_Set_Ldo11_Rtc_Vout                  \
    ((BL_Err_Type (*) (HBN_LDO_LEVEL_Type ldoLevel))ROM_APITABLE[ROM_API_INDEX_HBN_Set_Ldo11_Rtc_Vout])

#define RomDriver_HBN_Set_Ldo18flash_Repower_Delay        \
    ((BL_Err_Type (*) (uint8_t delay))ROM_APITABLE[ROM_API_INDEX_HBN_Set_Ldo18flash_Repower_Delay])

#define RomDriver_HBN_Set_MCU_Root_CLK_Sel                \
    ((BL_Err_Type (*) (HBN_MCU_ROOT_CLK_Type rootClk))ROM_APITABLE[ROM_API_INDEX_HBN_Set_MCU_Root_CLK_Sel])

#define RomDriver_HBN_Set_MCU_XCLK_Sel                    \
    ((BL_Err_Type (*) (HBN_MCU_XCLK_Type xclk))ROM_APITABLE[ROM_API_INDEX_HBN_Set_MCU_XCLK_Sel])

#define RomDriver_HBN_Set_MM_Power_Config                 \
    ((BL_Err_Type (*) (uint8_t pcfg))ROM_APITABLE[ROM_API_INDEX_HBN_Set_MM_Power_Config])

#define RomDriver_HBN_Set_PIR_Interval                    \
    ((BL_Err_Type (*) (uint16_t interval))ROM_APITABLE[ROM_API_INDEX_HBN_Set_PIR_Interval])

#define RomDriver_HBN_Set_PIR_Threshold                   \
    ((BL_Err_Type (*) (uint16_t threshold))ROM_APITABLE[ROM_API_INDEX_HBN_Set_PIR_Threshold])

#define RomDriver_HBN_Set_RTC_Misc_Cfg                    \
    ((BL_Err_Type (*) (HBN_RTC_MISC_Type *cfg))ROM_APITABLE[ROM_API_INDEX_HBN_Set_RTC_Misc_Cfg])

#define RomDriver_HBN_Set_RTC_Timer                       \
    ((BL_Err_Type (*) (HBN_RTC_INT_Delay_Type delay, uint32_t compValLow, uint32_t compValHigh, uint8_t compMode))ROM_APITABLE[ROM_API_INDEX_HBN_Set_RTC_Timer])

#define RomDriver_HBN_Set_Status_Flag                     \
    ((BL_Err_Type (*) (uint32_t flag))ROM_APITABLE[ROM_API_INDEX_HBN_Set_Status_Flag])

#define RomDriver_HBN_Set_UART_CLK_Sel                    \
    ((BL_Err_Type (*) (HBN_UART_CLK_Type clkSel))ROM_APITABLE[ROM_API_INDEX_HBN_Set_UART_CLK_Sel])

#define RomDriver_HBN_Set_Wakeup_Addr                     \
    ((BL_Err_Type (*) (uint32_t addr))ROM_APITABLE[ROM_API_INDEX_HBN_Set_Wakeup_Addr])

#define RomDriver_HBN_Set_Xtal_Type                       \
    ((BL_Err_Type (*) (uint8_t xtalType))ROM_APITABLE[ROM_API_INDEX_HBN_Set_Xtal_Type])

#define RomDriver_HBN_Trim_RC32K                          \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Trim_RC32K])

#define RomDriver_HBN_Get_BOD_OUT_State                   \
    ((BL_Sts_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Get_BOD_OUT_State])

#define RomDriver_HBN_Get_INT_State                       \
    ((BL_Sts_Type (*) (HBN_INT_Type irqType))ROM_APITABLE[ROM_API_INDEX_HBN_Get_INT_State])

#define RomDriver_HBN_Get_MCU_Root_CLK_Sel                \
    ((HBN_MCU_ROOT_CLK_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Get_MCU_Root_CLK_Sel])

#define RomDriver_HBN_Get_MCU_XCLK_Sel                    \
    ((HBN_MCU_XCLK_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Get_MCU_XCLK_Sel])

#define RomDriver_HBN_Get_Ldo18flash_Repower_Config       \
    ((uint16_t (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Get_Ldo18flash_Repower_Config])

#define RomDriver_HBN_Get_PIR_Interval                    \
    ((uint16_t (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Get_PIR_Interval])

#define RomDriver_HBN_Get_PIR_Threshold                   \
    ((uint16_t (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Get_PIR_Threshold])

#define RomDriver_HBN_Get_Status_Flag                     \
    ((uint32_t (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Get_Status_Flag])

#define RomDriver_HBN_Get_Wakeup_Addr                     \
    ((uint32_t (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Get_Wakeup_Addr])

#define RomDriver_HBN_Get_Core_Unhalt_Config              \
    ((uint8_t (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Get_Core_Unhalt_Config])

#define RomDriver_HBN_Get_Hand_Off_Config                 \
    ((uint8_t (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Get_Hand_Off_Config])

#define RomDriver_HBN_Get_MM_Power_Config                 \
    ((uint8_t (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Get_MM_Power_Config])

#define RomDriver_HBN_Get_Pin_Wakeup_Mode                 \
    ((uint8_t (*) (void))ROM_APITABLE[ROM_API_INDEX_HBN_Get_Pin_Wakeup_Mode])

#define RomDriver_HBN_Enable                              \
    ((void (*) (uint32_t aGPIOIeCfg, HBN_LDO_LEVEL_Type ldoLevel, HBN_LEVEL_Type hbnLevel, uint8_t dcdcPuSeq))ROM_APITABLE[ROM_API_INDEX_HBN_Enable])

#define RomDriver_HBN_Mode_Enter                          \
    ((void (*) (HBN_APP_CFG_Type *cfg))ROM_APITABLE[ROM_API_INDEX_HBN_Mode_Enter])

#define RomDriver_HBN_Power_Down_Flash                    \
    ((void (*) (SPI_Flash_Cfg_Type *flashCfg))ROM_APITABLE[ROM_API_INDEX_HBN_Power_Down_Flash])

#define RomDriver_L1C_DCache_Clean_All                    \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_L1C_DCache_Clean_All])

#define RomDriver_L1C_DCache_Clean_By_Addr                \
    ((BL_Err_Type (*) (uintptr_t addr, uint32_t len))ROM_APITABLE[ROM_API_INDEX_L1C_DCache_Clean_By_Addr])

#define RomDriver_L1C_DCache_Clean_Invalid_All            \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_L1C_DCache_Clean_Invalid_All])

#define RomDriver_L1C_DCache_Clean_Invalid_By_Addr        \
    ((BL_Err_Type (*) (uintptr_t addr, uint32_t len))ROM_APITABLE[ROM_API_INDEX_L1C_DCache_Clean_Invalid_By_Addr])

#define RomDriver_L1C_DCache_Disable                      \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_L1C_DCache_Disable])

#define RomDriver_L1C_DCache_Enable                       \
    ((BL_Err_Type (*) (uint8_t wayDsiable))ROM_APITABLE[ROM_API_INDEX_L1C_DCache_Enable])

#define RomDriver_L1C_DCache_Invalid_All                  \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_L1C_DCache_Invalid_All])

#define RomDriver_L1C_DCache_Invalid_By_Addr              \
    ((BL_Err_Type (*) (uintptr_t addr, uint32_t len))ROM_APITABLE[ROM_API_INDEX_L1C_DCache_Invalid_By_Addr])

