RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/inc/bl808_romdriver_e907.h
#define RomDriver_L1C_ICache_Disable                      \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_L1C_ICache_Disable])

#define RomDriver_L1C_ICache_Enable                       \
    ((BL_Err_Type (*) (uint8_t wayDsiable))ROM_APITABLE[ROM_API_INDEX_L1C_ICache_Enable])

#define RomDriver_L1C_ICache_Invalid_All                  \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_L1C_ICache_Invalid_All])

#define RomDriver_L1C_ICache_Invalid_By_Addr              \
    ((BL_Err_Type (*) (uintptr_t addr, uint32_t len))ROM_APITABLE[ROM_API_INDEX_L1C_ICache_Invalid_By_Addr])

#define RomDriver_L1C_Set_Cache_Setting_By_ID             \
    ((BL_Err_Type (*) (uint8_t core, L1C_CACHE_Cfg_Type *cacheSetting))ROM_APITABLE[ROM_API_INDEX_L1C_Set_Cache_Setting_By_ID])

#define RomDriver_L1C_Set_Wrap                            \
    ((BL_Err_Type (*) (uint8_t en))ROM_APITABLE[ROM_API_INDEX_L1C_Set_Wrap])

#define RomDriver_L1C_Get_None_Cache_Addr                 \
    ((int (*) (uintptr_t addr))ROM_APITABLE[ROM_API_INDEX_L1C_Get_None_Cache_Addr])

#define RomDriver_L1C_Is_DCache_Range                     \
    ((int (*) (uintptr_t addr))ROM_APITABLE[ROM_API_INDEX_L1C_Is_DCache_Range])

#define RomDriver_L1C_DCache_Write_Set                    \
    ((void (*) (BL_Fun_Type wtEn, BL_Fun_Type wbEn, BL_Fun_Type waEn))ROM_APITABLE[ROM_API_INDEX_L1C_DCache_Write_Set])

#define RomDriver_PDS_Default_Level_Config                \
    ((BL_Err_Type (*) (PDS_DEFAULT_LV_CFG_Type *defaultLvCfg, PDS_CTRL_RAM1_Type *ram1Cfg, PDS_CTRL_RAM2_Type *ram2Cfg, uint32_t pdsSleepCnt))ROM_APITABLE[ROM_API_INDEX_PDS_Default_Level_Config])

#define RomDriver_PDS_Enable                              \
    ((BL_Err_Type (*) (PDS_CTL_Type *cfg, PDS_CTL4_Type *cfg4, uint32_t pdsSleepCnt))ROM_APITABLE[ROM_API_INDEX_PDS_Enable])

#define RomDriver_PDS_Force_Config                        \
    ((BL_Err_Type (*) (PDS_CTL2_Type *cfg2, PDS_CTL3_Type *cfg3, PDS_CTL5_Type *cfg5))ROM_APITABLE[ROM_API_INDEX_PDS_Force_Config])

#define RomDriver_PDS_IntClear                            \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_PDS_IntClear])

#define RomDriver_PDS_IntMask                             \
    ((BL_Err_Type (*) (PDS_INT_Type intType, BL_Mask_Type intMask))ROM_APITABLE[ROM_API_INDEX_PDS_IntMask])

#define RomDriver_PDS_Power_On_MM_System                  \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_PDS_Power_On_MM_System])

#define RomDriver_PDS_RAM_Config                          \
    ((BL_Err_Type (*) (PDS_CTRL_RAM1_Type *ram1Cfg, PDS_CTRL_RAM2_Type *ram2Cfg))ROM_APITABLE[ROM_API_INDEX_PDS_RAM_Config])

#define RomDriver_PDS_Reset_LP_RTC                        \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_PDS_Reset_LP_RTC])

#define RomDriver_PDS_Set_Flash_Pad_Pull_None             \
    ((BL_Err_Type (*) (SF_Ctrl_Pin_Select pinCfg))ROM_APITABLE[ROM_API_INDEX_PDS_Set_Flash_Pad_Pull_None])

#define RomDriver_PDS_Set_Flash_Pad_Pull_None_Fast        \
    ((BL_Err_Type (*) (SF_Ctrl_Pin_Select pinCfg))ROM_APITABLE[ROM_API_INDEX_PDS_Set_Flash_Pad_Pull_None_Fast])

#define RomDriver_PDS_Set_GPIO_Pad_IntClr                 \
    ((BL_Err_Type (*) (PDS_GPIO_INT_SET_Type set))ROM_APITABLE[ROM_API_INDEX_PDS_Set_GPIO_Pad_IntClr])

#define RomDriver_PDS_Set_GPIO_Pad_IntMask                \
    ((BL_Err_Type (*) (GLB_GPIO_Type pad, BL_Mask_Type intMask))ROM_APITABLE[ROM_API_INDEX_PDS_Set_GPIO_Pad_IntMask])

#define RomDriver_PDS_Set_GPIO_Pad_IntMode                \
    ((BL_Err_Type (*) (PDS_GPIO_INT_SET_Type set, PDS_GPIO_INT_TRIG_Type trig))ROM_APITABLE[ROM_API_INDEX_PDS_Set_GPIO_Pad_IntMode])

#define RomDriver_PDS_Set_GPIO_Pad_Pn_Pu_Pd_Ie            \
    ((BL_Err_Type (*) (GLB_GPIO_Type pad, uint8_t pu, uint8_t pd, uint8_t ie))ROM_APITABLE[ROM_API_INDEX_PDS_Set_GPIO_Pad_Pn_Pu_Pd_Ie])

#define RomDriver_PDS_Set_LP_Clock_Disable                \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_PDS_Set_LP_Clock_Disable])

#define RomDriver_PDS_Set_LP_Clock_Enable                 \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_PDS_Set_LP_Clock_Enable])

#define RomDriver_PDS_Set_LP_RTC_CLK                      \
    ((BL_Err_Type (*) (uint8_t enable, uint16_t div))ROM_APITABLE[ROM_API_INDEX_PDS_Set_LP_RTC_CLK])

#define RomDriver_PDS_Set_LP_Reset_Address                \
    ((BL_Err_Type (*) (uint32_t addr))ROM_APITABLE[ROM_API_INDEX_PDS_Set_LP_Reset_Address])

#define RomDriver_PDS_Set_LP_System_CLK                   \
    ((BL_Err_Type (*) (PDS_LP_SYS_CLK_Type clkFreq))ROM_APITABLE[ROM_API_INDEX_PDS_Set_LP_System_CLK])

#define RomDriver_PDS_Set_LP_System_CLK_Div               \
    ((BL_Err_Type (*) (uint8_t div))ROM_APITABLE[ROM_API_INDEX_PDS_Set_LP_System_CLK_Div])

#define RomDriver_PDS_Set_MCU0_Clock_Disable              \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_PDS_Set_MCU0_Clock_Disable])

#define RomDriver_PDS_Set_MCU0_Clock_Enable               \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_PDS_Set_MCU0_Clock_Enable])

#define RomDriver_PDS_Set_MCU0_Reset_Address              \
    ((BL_Err_Type (*) (uint32_t addr))ROM_APITABLE[ROM_API_INDEX_PDS_Set_MCU0_Reset_Address])

#define RomDriver_PDS_Set_USB_Resume                      \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_PDS_Set_USB_Resume])

#define RomDriver_PDS_Set_USB_Suspend                     \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_PDS_Set_USB_Suspend])

#define RomDriver_PDS_Trim_RC32M                          \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_PDS_Trim_RC32M])

#define RomDriver_PDS_Turn_Off_USB                        \
    ((BL_Err_Type (*) (void))ROM_APITABLE[ROM_API_INDEX_PDS_Turn_Off_USB])

#define RomDriver_PDS_Turn_On_USB                         \
    ((BL_Err_Type (*) (uint8_t waitReady))ROM_APITABLE[ROM_API_INDEX_PDS_Turn_On_USB])

#define RomDriver_PDS_Get_GPIO_Pad_IntStatus              \
    ((BL_Sts_Type (*) (GLB_GPIO_Type pad))ROM_APITABLE[ROM_API_INDEX_PDS_Get_GPIO_Pad_IntStatus])

#define RomDriver_PDS_Get_IntStatus                       \
    ((BL_Sts_Type (*) (PDS_INT_Type intType))ROM_APITABLE[ROM_API_INDEX_PDS_Get_IntStatus])

